      *
      * Title: LIXMLTRM.CPY: Terminate and test status definitions.
      *
      * Copyright (C) 2008,2010 Micro Focus. All rights reserved.
      *
      * You have a royalty-free right to use, modify, reproduce, and
      * distribute this COBOL source file (and/or any modified version)
      * in any way you find useful, provided that you retain this notice
      * and agree that Micro Focus has no warranty, obligations, or
      * liability for any such use of the source file.
      *
      * Version Identification:
      *   $Revision: 67187 $
      *   $Date: 2015-03-23 19:18:56 +0000 (Mon, 23 Mar 2015) $
      *
           Display "Status: " XML-Status.
           Perform Display-Status.
           XML TERMINATE.
           Perform Display-Status.
      *
      * End of LIXMLTRM.CPY.
      *
