       IDENTIFICATION DIVISION.
       PROGRAM-ID.                      ATM.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 CURRENT-DATE.
	      05 DATE-YYYY                 PIC 9(4).
	      05 DATE-MM                   PIC 9(2).
	      05 DATE-DD                   PIC 9(2).
       01 MENU-TITLE                    PIC X(30) VALUE SPACES.
       01 USER-OPTION                   PIC X VALUE SPACE.
       01 ERROR-FLAG                    PIC X VALUE SPACES.
	      88 VALID                     VALUE "Y".
	      88 NOT-VALID                 VALUE "N".
	      88 STOP-RUN                  VALUE "S".
       01 ERROR-MESSAGE                 PIC X(30) VALUE SPACES.
       01 ENTER-AMOUNT                  PIC S9(5)V99 VALUE ZEROS.
       01 RECEIPT-REQUIRED              PIC X VALUE SPACE.
       01 WS-MASTER-RECORD.
	      05 WS-MASTER-ACCOUNT    		PIC X(4) VALUE SPACES.
           05 WS-MASTER-NAME        	PIC X(30) VALUE SPACES.
	      05 WS-MASTER-BALANCE         PIC S9(5)V99 VALUE ZEROS.
          
       01 TRANS-COUNT                   PIC 9 VALUE ZEROS.
       01 TRANSACTIONS.
           05 TRANSACTION-TABLE OCCURS 3 TIMES.
               10 TABLE-DATE.
                   15 TABLE-YEAR            PIC 9(4).
                   15 TABLE-MONTH           PIC 9(2).
                   15 TABLE-DAY             PIC 9(2).
               10 TABLE-TIME.
                   15 TABLE-HOURS           PIC 9(2).
                   15 TABLE-MINUTES         PIC 9(2).
                   15 TABLE-SECONDS         PIC 9(2).
                   15 TABLE-HUNDREDS        PIC 9(2).     
               10 TABLE-TYPE        	    PIC X.
                   88 TABLE-DEPOSIT         VALUE "D".
                   88 TABLE-WITHDRAW        VALUE "W".
               10 TABLE-AMOUNT              PIC -$$$$$9.99.

       SCREEN SECTION.
       01 WELCOME-SCREEN.
		   05 BLANK SCREEN.
		   05 LINE 01 COLUMN 33 "WELCOME TO".
		   05 LINE 03 COLUMN 26 "THE BANK OF AcuCOBOL".
		   05 LINE 05 COLUMN 31 FROM DATE-DD.
		   05 LINE 05 COLUMN 34 "/".
		   05 LINE 05 COLUMN 36 FROM DATE-MM.
		   05 LINE 05 COLUMN 39 "/".
		   05 LINE 05 COLUMN 41 FROM DATE-YYYY.
		   05 LINE 09 COLUMN 20 "PLEASE ENTER YOUR ACCOUNT CODE TO BEGIN".
		   05 LINE 11 COLUMN 36 USING WS-MASTER-ACCOUNT.
       
       01 MAIN-MENU.
		   05 BLANK SCREEN.
		   05 LINE 01 COLUMN 30 "WELCOME".
		   05 LINE 01 COLUMN 38 FROM WS-MASTER-NAME.
		   05 LINE 04 COLUMN 15 "1 = WITHDRAWL".
		   05 LINE 06 COLUMN 15 "2 = DEPOSIT".
	       05 LINE 08 COLUMN 15 "3 = TRANSACTION ENQUIRY".
		   05 LINE 10 COLUMN 15 "4 = QUIT".
		   05 LINE 13 COLUMN 15 "CHOOSE AN OPTION - ".
           05 LINE 13 COLUMN 34 TO USER-OPTION REQUIRED AUTO.

       01 AMOUNT-SCREEN.
		   05 BLANK SCREEN.
		   05 LINE 01 COLUMN 35 FROM MENU-TITLE.
		   05 LINE 06 COLUMN 20 "CURRENT BALANCE: ".
		   05 LINE 06 COLUMN 38 PIC -$$$$$9.99 FROM WS-MASTER-BALANCE.
		   05 LINE 10 COLUMN 20 "PLEASE ENTER AN AMOUNT: ".
		   05 LINE 10 COLUMN 43 PIC -$$$$$9.99 USING ENTER-AMOUNT.

       01 TRANSACTION-SCREEN.
		   05 BLANK SCREEN.
		   05 LINE 01 COLUMN 20 "TRANSACTION ENQUIRY FOR ".
		   05 LINE 01 COLUMN 44 USING WS-MASTER-NAME.
		   05 LINE 06 COLUMN 18 "DATE".
		   05 LINE 06 COLUMN 31 "TIME".
		   05 LINE 06 COLUMN 42 "TYPE".
		   05 LINE 06 COLUMN 49 "AMOUNT".
		   05 LINE 08 COLUMN 18 "----------".
		   05 LINE 08 COLUMN 31 "--------".
		   05 LINE 08 COLUMN 42 "----".
		   05 LINE 08 COLUMN 49 "----------".
		   05 LINE 10 COLUMN 18 FROM TABLE-DAY(1).
           05 LINE 10 COLUMN 20 "/".
		   05 LINE 10 COLUMN 21 FROM TABLE-MONTH(1).
		   05 LINE 10 COLUMN 23 "/".
		   05 LINE 10 COLUMN 24 FROM TABLE-YEAR(1).
		   05 LINE 10 COLUMN 31 FROM TABLE-HOURS(1).
		   05 LINE 10 COLUMN 33 ":".
		   05 LINE 10 COLUMN 34 FROM TABLE-MINUTES(1).
		   05 LINE 10 COLUMN 36 ":".
		   05 LINE 10 COLUMN 37 FROM TABLE-SECONDS(1).
		   05 LINE 10 COLUMN 42 FROM TABLE-TYPE(1).
		   05 LINE 10 COLUMN 49 PIC -$$$$$9.99 USING TABLE-AMOUNT(1).
		   05 LINE 12 COLUMN 18 FROM TABLE-DAY(2).
           05 LINE 12 COLUMN 20 "/".
		   05 LINE 12 COLUMN 21 FROM TABLE-MONTH(2).
		   05 LINE 12 COLUMN 23 "/".
		   05 LINE 12 COLUMN 24 FROM TABLE-YEAR(2).
		   05 LINE 12 COLUMN 31 FROM TABLE-HOURS(2).
		   05 LINE 12 COLUMN 33 ":".
		   05 LINE 12 COLUMN 34 FROM TABLE-MINUTES(2).
		   05 LINE 12 COLUMN 36 ":".
		   05 LINE 12 COLUMN 37 FROM TABLE-SECONDS(2).
		   05 LINE 12 COLUMN 42 FROM TABLE-TYPE(2).
		   05 LINE 12 COLUMN 49 PIC -$$$$$9.99 USING TABLE-AMOUNT(2).
		   05 LINE 14 COLUMN 18 FROM TABLE-DAY(3).
           05 LINE 14 COLUMN 20 "/".
		   05 LINE 14 COLUMN 21 FROM TABLE-MONTH(3).
		   05 LINE 14 COLUMN 23 "/".
		   05 LINE 14 COLUMN 24 FROM TABLE-YEAR(3).
		   05 LINE 14 COLUMN 31 FROM TABLE-HOURS(3).
		   05 LINE 14 COLUMN 33 ":".
		   05 LINE 14 COLUMN 34 FROM TABLE-MINUTES(3).
		   05 LINE 14 COLUMN 36 ":".
		   05 LINE 14 COLUMN 37 FROM TABLE-SECONDS(3).
		   05 LINE 14 COLUMN 42 FROM TABLE-TYPE(3).
		   05 LINE 14 COLUMN 49 PIC -$$$$$9.99 USING TABLE-AMOUNT(3).

       PROCEDURE DIVISION.
           
           CALL "processing"
           PERFORM DISPLAY-WELCOME-SCREEN
           CALL "SQL-DISCONNECT"
           CANCEL "processing"
           GOBACK.

       DISPLAY-WELCOME-SCREEN.
		   PERFORM UNTIL 1 = 2
			   INITIALIZE WS-MASTER-RECORD ERROR-MESSAGE ERROR-FLAG
		       ACCEPT CURRENT-DATE FROM DATE YYYYMMDD
		       DISPLAY WELCOME-SCREEN
		       ACCEPT WELCOME-SCREEN
               IF WS-MASTER-ACCOUNT = 9999
                   EXIT PERFORM
               ELSE
				   CALL "INITIAL" USING WS-MASTER-RECORD ERROR-FLAG ERROR-MESSAGE
				   PERFORM ERROR-HANDLING
				   IF VALID
                       PERFORM MAIN-MENU
				   ELSE
					   DISPLAY "ACCOUNT DOESN'T EXIST!" AT 0625 ERASE SCREEN
                       DISPLAY "PRESS ENTER TO CONTINUE." AT 0825
                       ACCEPT OMITTED AT 0850
				   END-IF
			   END-IF
		   END-PERFORM.
       
       MAIN-MENU.
           PERFORM UNTIL 1 = 2
		       DISPLAY MAIN-MENU
               ACCEPT MAIN-MENU
               EVALUATE USER-OPTION
				   WHEN "1"
					   PERFORM WITHDRAWL
				   WHEN "2"
					   PERFORM DEPOSIT
				   WHEN "3"
					   PERFORM ENQUIRY
				   WHEN "4"
					   EXIT PERFORM
				   WHEN OTHER
				   DISPLAY "WRONG OPTION!" AT 1515
				   DISPLAY "PRESS ENTER TO CONTINUE." AT 1715
				   ACCEPT OMITTED AT 1740
			   END-EVALUATE
           END-PERFORM.
       
       WITHDRAWL.
		   MOVE "WITHDRAWL" TO MENU-TITLE
		   PERFORM UNTIL 1 = 2
			   INITIALIZE ENTER-AMOUNT RECEIPT-REQUIRED ERROR-MESSAGE ERROR-FLAG
		       DISPLAY AMOUNT-SCREEN
		       ACCEPT AMOUNT-SCREEN
               EVALUATE ENTER-AMOUNT
				   WHEN <= 0
					   DISPLAY "AMOUNT CANNOT BE ZERO OR NEGATIVE!" AT 2420
					   ACCEPT OMITTED AT 2455
				   WHEN > WS-MASTER-BALANCE
					   DISPLAY "INSUFFICIENT FUNDS! PRESS ENTER TO CONTINUE." AT 2420
					   ACCEPT OMITTED AT 2465
					   EXIT PERFORM
				   WHEN OTHER
					   PERFORM RECEIPT-CHECK
					   CALL "WITHDRAWL" USING WS-MASTER-RECORD ENTER-AMOUNT RECEIPT-REQUIRED ERROR-MESSAGE ERROR-FLAG
					   PERFORM ERROR-HANDLING
					   EXIT PERFORM
               END-EVALUATE
           END-PERFORM.

       DEPOSIT.
		   MOVE "DEPOSIT" TO MENU-TITLE
		   PERFORM UNTIL 1 = 2
			   INITIALIZE ENTER-AMOUNT RECEIPT-REQUIRED ERROR-MESSAGE ERROR-FLAG
		       DISPLAY AMOUNT-SCREEN
		       ACCEPT AMOUNT-SCREEN
               EVALUATE ENTER-AMOUNT
				   WHEN <= 0
					   DISPLAY "AMOUNT CANNOT BE ZERO OR NEGATIVE!" AT 2420
					   ACCEPT OMITTED AT 2455
				   WHEN OTHER
					   IF (ENTER-AMOUNT + WS-MASTER-BALANCE) >= 100000
						   DISPLAY "TOO MUCH MONEY. OPEN AN ISA!" AT 2420
						   ACCEPT OMITTED AT 2455
					   ELSE
					       PERFORM RECEIPT-CHECK
					       CALL "DEPOSIT" USING WS-MASTER-RECORD ENTER-AMOUNT RECEIPT-REQUIRED ERROR-MESSAGE ERROR-FLAG
						   PERFORM ERROR-HANDLING
					       EXIT PERFORM
					   END-IF
               END-EVALUATE
           END-PERFORM.
       
       ENQUIRY.
		   INITIALIZE TRANS-COUNT TRANSACTIONS ERROR-MESSAGE ERROR-FLAG
		   CALL "ENQUIRY" USING WS-MASTER-RECORD TRANS-COUNT TRANSACTIONS ERROR-MESSAGE ERROR-FLAG
		   PERFORM ERROR-HANDLING
           PERFORM DISPLAY-TRANSACTION-SCREEN.  

       RECEIPT-CHECK.
		   PERFORM UNTIL 1 = 2
		       DISPLAY "WOULD YOU LIKE A RECEIPT? Y/N" AT 2420
		       ACCEPT RECEIPT-REQUIRED AT 2450
			   IF RECEIPT-REQUIRED = "Y" OR "y"
                   EXIT PERFORM
               ELSE
                   IF NOT (RECEIPT-REQUIRED = "N" OR "n")
                       DISPLAY "WRONG OPTION, TRY AGAIN!" AT 2420 ERASE SCREEN
					   INITIALIZE RECEIPT-REQUIRED
                       ACCEPT OMITTED AT 2445
                   ELSE
                       EXIT PERFORM
                   END-IF
               END-IF
           END-PERFORM.

       DISPLAY-TRANSACTION-SCREEN.
		   EVALUATE TRANS-COUNT
			   WHEN <= 0
				   DISPLAY "NO TRANSACTIONS RECORDED!" AT 0625 ERASE SCREEN
			       DISPLAY "PRESS ENTER TO CONTINUE." AT 0825
			       ACCEPT OMITTED AT 0850
		       WHEN 1
		           DISPLAY TRANSACTION-SCREEN
		           DISPLAY "PRESS ENTER TO CONTINUE." AT 1218 ERASE END SCREEN
			       ACCEPT OMITTED AT 1443
			   WHEN 2
				   DISPLAY TRANSACTION-SCREEN
		           DISPLAY "PRESS ENTER TO CONTINUE." AT 1418 ERASE END SCREEN
			       ACCEPT OMITTED AT 1443
			   WHEN 3
				   DISPLAY TRANSACTION-SCREEN
		           DISPLAY "PRESS ENTER TO CONTINUE." AT 1618 ERASE END SCREEN
			       ACCEPT OMITTED AT 1643
		   END-EVALUATE.

       ERROR-HANDLING.
		   IF NOT (ERROR-MESSAGE = SPACES)
			   DISPLAY ERROR-MESSAGE AT 2420 ERASE END SCREEN
			   ACCEPT OMITTED AT 2455
			   IF STOP-RUN
			        STOP RUN
			   END-IF
		   END-IF.

