       IDENTIFICATION DIVISION.
       PROGRAM-ID.                      CJAVA-DBCONNECT.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 DB-DRIVERSTR         PIC X(256).
       01 DB-CONNECTSTR        PIC X(256).
       01 DB-QUERY             PIC X(256).
       01 DB-CONNECT           USAGE HANDLE.
       01 DB-RESULTSET         USAGE HANDLE.
       01 FIELD-BOOLRET        PIC 9(2).
       01 FIELD-RET            PIC 9(2).
       01 FIELD-INT            PIC 9(2).
       01 LAST-ROW             PIC 9(2).
       01 MENU-TITLE           PIC X(50) VALUE "CUSTOMER ACCOUNT".

       01 STATUS-VAL   PIC S9(02) VALUE ZERO.

       01 RECORD-TABLE OCCURS 15 TIMES.
          05 FIELD-STRINGSET         PIC X(50).

       COPY "JAVA.DEF".

       LINKAGE SECTION.

       SCREEN SECTION.
       01 DISPLAY-RECORD.
           05 BLANK SCREEN .
           05 LINE 01 COLUMN 30 FROM MENU-TITLE.
           05 LINE 04 COLUMN 11 "ACCOUNT NUMBER: ".
           05 LINE 04 COLUMN 27 PIC X(4) USING FIELD-STRINGSET(1) REQUIRED.
           05 LINE 06 COLUMN 11 "NAME: ".
           05 LINE 06 COLUMN 17 PIC X(30) USING FIELD-STRINGSET(2) REQUIRED.
           05 LINE 08 COLUMN 11 "STREET: ".
           05 LINE 08 COLUMN 19 PIC X(30) USING FIELD-STRINGSET(3) REQUIRED.
           05 LINE 10 COLUMN 11 "CITY: ".
           05 LINE 10 COLUMN 17 PIC X(30) USING FIELD-STRINGSET(4) REQUIRED.
           05 LINE 12 COLUMN 11 "STATE: ".
           05 LINE 12 COLUMN 18 PIC X(2) USING FIELD-STRINGSET(5) REQUIRED.
           05 LINE 14 COLUMN 11 "ZIP CODE: ".
           05 LINE 14 COLUMN 21 PIC X(10) USING FIELD-STRINGSET(6) REQUIRED.
           05 LINE 16 COLUMN 11 "TELEPHONE: ".
           05 LINE 16 COLUMN 22 "(".
           05 LINE 16 COLUMN 23 PIC X(3) USING FIELD-STRINGSET(7) REQUIRED AUTO.
           05 LINE 16 COLUMN 26 ")".
           05 LINE 16 COLUMN 28 PIC X(3) USING FIELD-STRINGSET(8) REQUIRED AUTO.
           05 LINE 16 COLUMN 31 "-".
           05 LINE 16 COLUMN 32 PIC X(4) USING FIELD-STRINGSET(9) REQUIRED.
           05 LINE 18 COLUMN 11 "EXTENSION: ".
           05 LINE 18 COLUMN 22 PIC X(5) USING FIELD-STRINGSET(10).
           05 LINE 20 COLUMN 11 "START DATE YYYYMMDD: ".
           05 LINE 20 COLUMN 32 PIC X(4) USING FIELD-STRINGSET(11) REQUIRED AUTO.
           05 LINE 20 COLUMN 36 "-".
           05 LINE 20 COLUMN 37 PIC X(2) USING FIELD-STRINGSET(12) REQUIRED AUTO.
           05 LINE 20 COLUMN 39 "-".
           05 LINE 20 COLUMN 40 PIC X(2) USING FIELD-STRINGSET(13) REQUIRED.
           05 LINE 22 COLUMN 11 "BALANCE: ".
           05 LINE 22 COLUMN 20 "�".
           05 LINE 22 COLUMN 21 PIC X(9) USING FIELD-STRINGSET(14) REQUIRED.

       PROCEDURE DIVISION.
           
           DISPLAY "Connecting to SQL SERVER..." AT 1025 ERASE SCREEN
           MOVE "com.microsoft.sqlserver.jdbc.SQLServerDriver" to DB-DRIVERSTR
           MOVE "jdbc:sqlserver://SLES12-mturner:1433;DatabaseName=support;user=support;password=strongPassword123;" to DB-CONNECTSTR
           MOVE "SELECT * FROM CUSTOMER" to DB-QUERY.

           CALL "C$JAVA" USING CJAVA-DBCONNECT DB-DRIVERSTR DB-CONNECTSTR GIVING DB-CONNECT

           CALL "C$JAVA" USING CJAVA-DBQUERY DB-QUERY DB-CONNECT GIVING DB-RESULTSET

           PERFORM JDBC-QUERY UNTIL FIELD-RET = 0

           CALL "C$JAVA" USING CJAVA-DELETE DB-CONNECT GIVING STATUS-VAL
           
           CALL "C$JAVA" USING CJAVA-DELETE DB-RESULTSET GIVING STATUS-VAL

           GOBACK.

       JDBC-QUERY.
           
           CALL "C$JAVA" USING CJAVA-CALL DB-RESULTSET "java/sql/ResultSet" "next" "()Z" FIELD-BOOLRET GIVING STATUS-VAL
    
           CALL "C$JAVA" USING CJAVA-CALL DB-RESULTSET "java/sql/ResultSet" "getRow" "()I" FIELD-RET GIVING STATUS-VAL

           IF FIELD-RET = 0
               DISPLAY "End Of Records." AT 1030 ERASE SCREEN
               ACCEPT OMITTED
               EXIT PARAGRAPH
           END-IF
    
           PERFORM VARYING FIELD-INT FROM 1 BY 1 UNTIL FIELD-INT = 15    
               
               CALL "C$JAVA" USING CJAVA-CALL DB-RESULTSET "java/sql/ResultSet" "getString" "(I)X" FIELD-INT FIELD-STRINGSET(FIELD-INT) GIVING STATUS-VAL

           END-PERFORM

           DISPLAY DISPLAY-RECORD
           ACCEPT OMITTED.

               