       IDENTIFICATION DIVISION.
       PROGRAM-ID.
            UTC-WORLDTIMEAPI-JPARSE.
       AUTHOR.
            SUPPORT.
       DATE-WRITTEN.
            29 NOVEMBER 2022 16 : 06 : 56.
       REMARKS.
            Compile with: -rw DAY-OF-WEEK

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       COPY "acugui.def".
       COPY "acucobol.def".
       COPY "crtvars.def".
       COPY "showmsg.def".
       copy "lixmlall.cpy".
       77 Quit-Mode-Flag PIC S9(5) COMP-4 VALUE 0.
       77 KEY-STATUS IS SPECIAL-NAMES CRT STATUS PIC 9(4) VALUE 0.
            88 EXIT-PUSHED VALUE 27.
            88 MESSAGE-RECEIVED VALUE 95.
            88 EVENT-OCCURRED VALUE 96.
            88 SCREEN-NO-INPUT-FIELD VALUE 97.
            88 SCREEN-TIME-OUT VALUE 99.
       77 SCREEN1-HANDLE USAGE IS HANDLE OF WINDOW VALUE NULL.
       77 RESPONSE-STATUS-DISPLAY PIC ZZ9.
       01 EXIT-STATUS PIC 99 VALUE IS ZEROS.
            88 EXIT-STATUS-OK VALUE IS 0.
       01 WORLDTIME-RESPONSE.
            05 ABBREVIATION PIC X(3).
            05 CLIENT_IP PIC X(20).
            05 DATETIME PIC X(32).
            05 DAY_OF_WEEK PIC X(2).
            05 DAY_OF_YEAR PIC X(5).
            05 DST PIC 9(1).
            05 DST_FROM PIC X(5).
            05 DST_OFFSET PIC X(5).
            05 DST_UNTIL PIC X(5).
            05 RAW_OFFSET PIC X(5).
            05 TIMEZONE PIC X(32).
            05 UNIXTIME PIC X(10).
            05 UTC_DATETIME PIC X(32).
            05 UTC_OFFSET PIC X(10).
            05 WEEK_NUMBER PIC X(4).
       01 DAYOFWEEK PIC X(2).
       01 HTTP-RESPONSE-ADD PIC X(1100).
       01 POST-ADDRESS-BUILD.
            02 POST-HEAD PIC X(30) VALUE 
            "http://worldtimeapi.org/api/ip"
            .
       01 POST-ADDRESS PIC X(31) VALUES SPACES.
       78 CONTENT-TYPE VALUE "text/xml; charset=utf-8".
       01 RESPONSE-PAYLOAD USAGE POINTER.
       01 RESPONSE-STATUS PIC 9(3) VALUE ZEROS.
       01 RESPONSE-STATUS-2 PIC 9(3) VALUE ZEROS.
       01 RESPONSE-LEN PIC S9(5).
       01 A-SINGLE-CHAR PIC X VALUE SPACES.
       LINKAGE SECTION.
       01 HTTP-RESPONSE PIC X(1000).
       SCREEN SECTION.
       01 SCREEN1.
            03 SCREEN1-PB-1 PUSH-BUTTON COL 4.20 LINE 3.70 LINES 4.40
              CELLS SIZE 13.90 CELLS EXCEPTION-VALUE 777 ID IS 1 TITLE
              "Get UTC time".
            03 SCREEN1-LA-1 LABEL COL 22.50 LINE 5.20 LINES 2.50 CELLS
              SIZE 10.60 CELLS ID IS 2 LABEL-OFFSET 0 TITLE
              "Response status:".
            03 SCREEN1-LA-2 LABEL COL 33.40 LINE 5.00 LINES 2.30 CELLS
              SIZE 3.50 CELLS ID IS 3 LABEL-OFFSET 0 TITLE
              RESPONSE-STATUS-DISPLAY.
            03 SCREEN1-LA-3 LABEL COL 2.70 LINE 9.30 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 4 RIGHT LABEL-OFFSET 0 TITLE
              "abbreviation:".
            03 SCREEN1-LA-4 LABEL COL 2.60 LINE 11.90 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 5 RIGHT LABEL-OFFSET 0 TITLE
              "client IP:".
            03 SCREEN1-LA-5 LABEL COL 2.60 LINE 14.50 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 6 RIGHT LABEL-OFFSET 0 TITLE
              "Date Time:".
            03 SCREEN1-LA-6 LABEL COL 2.60 LINE 17.10 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 7 RIGHT LABEL-OFFSET 0 TITLE
              "Day of week:".
            03 SCREEN1-LA-7 LABEL COL 2.60 LINE 19.70 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 8 RIGHT LABEL-OFFSET 0 TITLE
              "Day of Year:".
            03 SCREEN1-LA-8 LABEL COL 2.60 LINE 22.30 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 9 RIGHT LABEL-OFFSET 0 TITLE "DST:"
              .
            03 SCREEN1-LA-9 LABEL COL 2.60 LINE 24.90 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 10 RIGHT LABEL-OFFSET 0 TITLE
              "DST from:".
            03 SCREEN1-LA-10 LABEL COL 2.60 LINE 27.50 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 11 RIGHT LABEL-OFFSET 0 TITLE
              "DST offset:".
            03 SCREEN1-LA-11 LABEL COL 2.60 LINE 30.10 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 12 RIGHT LABEL-OFFSET 0 TITLE
              "DST until:".
            03 SCREEN1-LA-12 LABEL COL 2.60 LINE 32.70 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 13 RIGHT LABEL-OFFSET 0 TITLE
              "Raw offset:".
            03 SCREEN1-LA-12A LABEL COL 2.60 LINE 35.30 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 14 RIGHT LABEL-OFFSET 0 TITLE
              "Timezone:".
            03 SCREEN1-LA-12B LABEL COL 2.60 LINE 37.90 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 15 RIGHT LABEL-OFFSET 0 TITLE
              "Unixtime:".
            03 SCREEN1-LA-12BA LABEL COL 2.60 LINE 40.50 LINES 1.80
              CELLS SIZE 9.90 CELLS ID IS 16 RIGHT LABEL-OFFSET 0 TITLE
              "UTC Date Time:".
            03 SCREEN1-LA-12BB LABEL COL 2.70 LINE 43.10 LINES 1.80
              CELLS SIZE 9.90 CELLS ID IS 17 RIGHT LABEL-OFFSET 0 TITLE
              "UTC offset:".
            03 SCREEN1-LA-29 LABEL COL 2.70 LINE 45.70 LINES 1.80 CELLS
              SIZE 9.90 CELLS ID IS 34 RIGHT LABEL-OFFSET 0 TITLE
              "Week number:".
            03 SCREEN1-LA-13 LABEL COL 14.30 LINE 9.30 LINES 1.80 CELLS
              SIZE 3.20 CELLS ID IS 18 LABEL-OFFSET 0 TITLE ABBREVIATION
              .
            03 SCREEN1-LA-15 LABEL COL 14.40 LINE 11.90 LINES 1.80 CELLS
              SIZE 26.10 CELLS ID IS 20 LABEL-OFFSET 0 TITLE CLIENT-IP.
            03 SCREEN1-LA-18 LABEL COL 14.40 LINE 17.00 LINES 1.80 CELLS
              SIZE 8.40 CELLS ID IS 23 LABEL-OFFSET 0 TITLE DAYOFWEEK.
            03 SCREEN1-LA-21 LABEL COL 14.40 LINE 27.50 LINES 1.80 CELLS
              SIZE 7.70 CELLS ID IS 26 LABEL-OFFSET 0 TITLE DST-OFFSET.
            03 SCREEN1-LA-23 LABEL COL 14.40 LINE 30.10 LINES 1.80 CELLS
              SIZE 5.30 CELLS ID IS 28 LABEL-OFFSET 0 TITLE DST-UNTIL.
            03 SCREEN1-LA-24 LABEL COL 14.40 LINE 32.70 LINES 1.80 CELLS
              SIZE 7.30 CELLS ID IS 29 LABEL-OFFSET 0 TITLE RAW-OFFSET.
            03 SCREEN1-LA-25 LABEL COL 14.40 LINE 35.30 LINES 1.80 CELLS
              SIZE 38.30 CELLS ID IS 30 LABEL-OFFSET 0 TITLE TIMEZONE.
            03 SCREEN1-LA-26 LABEL COL 14.40 LINE 37.90 LINES 1.80 CELLS
              SIZE 11.60 CELLS ID IS 31 LABEL-OFFSET 0 TITLE UNIXTIME.
            03 SCREEN1-LA-27 LABEL COL 14.40 LINE 40.50 LINES 1.80 CELLS
              SIZE 39.10 CELLS ID IS 32 LABEL-OFFSET 0 TITLE
              UTC-DATETIME.
            03 SCREEN1-LA-28 LABEL COL 14.40 LINE 43.10 LINES 1.80 CELLS
              SIZE 18.50 CELLS ID IS 33 LABEL-OFFSET 0 TITLE UTC-OFFSET
              .
            03 SCREEN1-LA-30 LABEL COL 14.40 LINE 45.90 LINES 1.80 CELLS
              SIZE 13.40 CELLS ID IS 35 LABEL-OFFSET 0 TITLE WEEK-NUMBER
              .
            03 SCREEN1-LA-31 LABEL COL 14.40 LINE 24.90 LINES 1.80 CELLS
              SIZE 3.70 CELLS ID IS 36 LABEL-OFFSET 0 TITLE DST-FROM.
            03 SCREEN1-LA-32 LABEL COL 14.40 LINE 22.30 LINES 1.80 CELLS
              SIZE 10.10 CELLS ID IS 37 LABEL-OFFSET 0 TITLE DST.
            03 SCREEN1-LA-33 LABEL COL 14.40 LINE 19.70 LINES 1.80 CELLS
              SIZE 8.90 CELLS ID IS 38 LABEL-OFFSET 0 TITLE DAY-OF-YEAR
              .
            03 SCREEN1-LA-34 LABEL COL 14.40 LINE 14.50 LINES 1.80 CELLS
              SIZE 32.10 CELLS ID IS 39 LABEL-OFFSET 0 TITLE DATETIME.
            03 SCREEN1-PB-2 PUSH-BUTTON COL 54.30 LINE 46.50 LINES 3.80
              CELLS SIZE 9.60 CELLS ID IS 19 CANCEL-BUTTON TITLE "Exit"
              .

       PROCEDURE DIVISION USING HTTP-RESPONSE.
       ACU-MAIN-LOGIC.
            PERFORM ACU-INITIAL-ROUTINE
            PERFORM ACU-SCREEN1-ROUTINE
            PERFORM ACU-EXIT-RTN.
       ACU-EXTENDED-FILE-STATUS.
            CALL "C$RERRNAME" USING ACU-ERR-FILE
            CALL "C$RERR" USING EXTEND-STAT TEXT-MESSAGE
            MOVE PRIMARY-ERROR TO ACU-MSG-ID
            PERFORM ACU-SHOW-MSG.
       ACU-SHOW-MSG.
            MOVE SPACE TO ACU-MSG-1 ACU-MSG-2 ACU-MSG-3
            EVALUATE ACU-MSG-ID
              WHEN 10
              MOVE "No more data." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 22
              MOVE "Key duplication." TO ACU-MSG-1
              MOVE MB-ERROR-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 23
              MOVE "Record not found." TO ACU-MSG-1
              MOVE MB-WARNING-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 101
              MOVE "Quit?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 201
              MOVE "Add Record?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 202
              MOVE "Update Record?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 203
              MOVE "Delete Record?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 204
              MOVE "Key duplication." TO ACU-MSG-1
              MOVE MB-WARNING-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 301
              MOVE "Add Successful." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 302
              MOVE "Update Successful." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 303
              MOVE "Delete Successful." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 401
              MOVE "Shell not found." TO ACU-MSG-1
              MOVE MB-ERROR-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 901
              MOVE MB-WARNING-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN OTHER
              MOVE TEXT-MESSAGE TO ACU-MSG-1
              STRING "File:" ACU-ERR-FILE DELIMITED BY SPACE INTO
                ACU-MSG-2
              STRING "File status " PRIMARY-ERROR "," SECONDARY-ERROR
                DELIMITED BY SIZE INTO ACU-MSG-3
            END-EVALUATE
            PERFORM ACU-MESSAGE-BOX.
       ACU-MESSAGE-BOX.
            MOVE 1 TO ACU-TEXT-PTR
            IF ACU-MSG-1 NOT = SPACE
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-1 TALLYING ACU-SIZE FOR TRAILING SPACE
              STRING ACU-MSG-1 ( 1 : ACU-LENGTH - ACU-SIZE ) DELIMITED
                BY SIZE INTO ACU-MSG-TEXT POINTER ACU-TEXT-PTR
            END-IF
            IF ACU-MSG-2 NOT = SPACE
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-2 TALLYING ACU-SIZE FOR TRAILING SPACE
              IF ACU-TEXT-PTR > 1
                STRING X"0A" DELIMITED BY SIZE INTO ACU-MSG-TEXT POINTER
                  ACU-TEXT-PTR
              END-IF
              STRING ACU-MSG-2 ( 1 : ACU-LENGTH - ACU-SIZE ) DELIMITED
                BY SIZE INTO ACU-MSG-TEXT POINTER ACU-TEXT-PTR
            END-IF
            IF ACU-MSG-3 NOT = SPACE
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-3 TALLYING ACU-SIZE FOR TRAILING SPACE
              IF ACU-TEXT-PTR > 1
                STRING X"0A" DELIMITED BY SIZE INTO ACU-MSG-TEXT POINTER
                  ACU-TEXT-PTR
              END-IF
              STRING ACU-MSG-3 ( 1 : ACU-LENGTH - ACU-SIZE ) DELIMITED
                BY SIZE INTO ACU-MSG-TEXT POINTER ACU-TEXT-PTR
            END-IF
            IF ACU-TEXT-PTR = 1
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-TEXT TALLYING ACU-SIZE FOR TRAILING SPACE
              COMPUTE ACU-TEXT-PTR = ACU-FULL-LEN - ACU-SIZE + 1
            END-IF
            MOVE LOW-VALUES TO ACU-MSG-TEXT ( ACU-TEXT-PTR : 1 )
            DISPLAY MESSAGE BOX ACU-MSG-TEXT TYPE IS ACU-BUTTON-TYPE
              ICON IS ACU-ICON-TYPE DEFAULT IS ACU-DEFAULT-BUTTON
              RETURNING ACU-RETURN-VALUE.
       ACU-INITIAL-ROUTINE.
            ACCEPT SYSTEM-INFORMATION FROM SYSTEM-INFO
            ACCEPT TERMINAL-ABILITIES FROM TERMINAL-INFO.
       ACU-EXIT-RTN.
            PERFORM ACU-EXIT-FONT
            PERFORM ACU-EXIT-BMP
            EXIT PROGRAM
            STOP RUN.
       ACU-EXIT-FONT.
            .
       ACU-EXIT-BMP.
            .
       ACU-SCREEN1-ROUTINE.
            PERFORM ACU-SCREEN1-SCRN
            PERFORM ACU-SCREEN1-PROC.
       ACU-SCREEN1-SCRN.
            PERFORM ACU-SCREEN1-CREATE-WIN
            PERFORM ACU-SCREEN1-INIT-DATA.
       ACU-SCREEN1-CREATE-WIN.
            DISPLAY STANDARD GRAPHICAL WINDOW LINES 50.00 SIZE 64.00
              CELL HEIGHT 10 CELL WIDTH 10 AUTO-MINIMIZE COLOR IS 65793
              LABEL-OFFSET 0 LINK TO THREAD MODELESS NO SCROLL WITH
              SYSTEM MENU TITLE
              "WorldTimeAPI to get UTC time using JPARSE" TITLE-BAR NO
              WRAP EVENT PROCEDURE SCREEN1-EVENT-PROC HANDLE IS
              SCREEN1-HANDLE
            DISPLAY SCREEN1 UPON SCREEN1-HANDLE.
       ACU-SCREEN1-INIT-DATA.
            .
       ACU-SCREEN1-PROC.
            PERFORM UNTIL EXIT-PUSHED
            ACCEPT SCREEN1 ON EXCEPTION
            PERFORM ACU-SCREEN1-EVALUATE-FUNC
            END-ACCEPT
            END-PERFORM DESTROY SCREEN1-HANDLE
            INITIALIZE KEY-STATUS.
       ACU-SCREEN1-EVALUATE-FUNC.
            EVALUATE TRUE
              WHEN EXIT-PUSHED
              PERFORM ACU-SCREEN1-EXIT
              WHEN EVENT-OCCURRED
              IF EVENT-TYPE = CMD-CLOSE
                PERFORM ACU-SCREEN1-EXIT
              END-IF
              WHEN KEY-STATUS = 777
              PERFORM SCREEN1-PB-1-LINK
            END-EVALUATE
            MOVE 1 TO ACCEPT-CONTROL.
       ACU-SCREEN1-EXIT.
            SET EXIT-PUSHED TO TRUE.
       ACU-SCREEN1-EVENT-EXTRA.
            EVALUATE EVENT-TYPE
              WHEN MSG-CLOSE
              PERFORM ACU-SCREEN1-MSG-CLOSE
            END-EVALUATE.
       ACU-SCREEN1-MSG-CLOSE.
            ACCEPT QUIT-MODE-FLAG FROM ENVIRONMENT "QUIT_MODE"
            IF QUIT-MODE-FLAG = ZERO
              PERFORM ACU-SCREEN1-EXIT
              PERFORM ACU-EXIT-RTN
            END-IF.
       SCREEN1-EVENT-PROC.
            PERFORM ACU-SCREEN1-EVENT-EXTRA.
       SCREEN1-PB-1-LINK.
            STRING POST-HEAD DELIMITED BY SIZE INTO POST-ADDRESS.
            CALL "NetInit" GIVING RESPONSE-STATUS.
            CALL "NetSSLVerifyPeer" USING 0.
            CALL "HttpGet" USING POST-ADDRESS RESPONSE-PAYLOAD
              RESPONSE-LEN GIVING RESPONSE-STATUS.
            SET ADDRESS OF HTTP-RESPONSE TO RESPONSE-PAYLOAD.
            MOVE RESPONSE-STATUS TO RESPONSE-STATUS-DISPLAY.
            DISPLAY SCREEN1-LA-2.
            IF NOT RESPONSE-STATUS = 0
              CALL "NetGetError" USING RESPONSE-PAYLOAD RESPONSE-LEN
                GIVING RESPONSE-STATUS-2
              SET ADDRESS OF HTTP-RESPONSE TO RESPONSE-PAYLOAD
              DISPLAY "Error! " RESPONSE-STATUS
              DISPLAY "Error message: " HTTP-RESPONSE ( 1 : RESPONSE-LEN
                )
              CALL "NetFree" USING RESPONSE-PAYLOAD
              GO TO Z
            END-IF.
            IF RESPONSE-PAYLOAD = NULL
              DISPLAY "Error:  NULL pointer returned" LINE 10 BLINK
              ACCEPT A-SINGLE-CHAR PROMPT
              GO TO Z
            END-IF.
           JSON PARSE HTTP-RESPONSE INTO WORLDTIME-RESPONSE
             NAME WORLDTIME-RESPONSE IS OMITTED
           END-JSON
            MOVE DAY-OF-WEEK TO DAYOFWEEK.
            DISPLAY SCREEN1.
            CALL "NetFree" USING RESPONSE-PAYLOAD.
            CALL "NetCleanup".
       Z.
            PERFORM DISPLAY-STATUS.
            DISPLAY "finished." LINE 20 POSITION 5.
            ACCEPT A-SINGLE-CHAR PROMPT TAB.
            STOP RUN.
       DISPLAY-STATUS.
            IF NOT XML-ISSUCCESS
              PERFORM WITH TEST AFTER UNTIL XML-NOMORE
              CALL "XMLStatus" USING XML-STATUSTEXT XML-MOREFLAG
              DISPLAY XML-STATUSTEXT
              END-PERFORM
            END-IF.
       REPORT-COMPOSER SECTION.
