       IDENTIFICATION DIVISION.
       PROGRAM-ID.                 MENU.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       COPY "ACUGUI.DEF".
       COPY "ACUCOBOL.DEF".
       COPY "CRTVARS.DEF".
       COPY "SHOWMSG.DEF".

       77 QUIT-MODE-FLAG PIC S9(5) COMP-4 VALUE 0.
       77 KEY-STATUS IS SPECIAL-NAMES CRT STATUS PIC 9(4) VALUE 0.
           88 EXIT-PUSHED VALUE 27.
           88 MESSAGE-RECEIVED VALUE 95.
           88 EVENT-OCCURRED VALUE 96.
           88 SCREEN-NO-INPUT-FIELD VALUE 97.
           88 SCREEN-TIME-OUT VALUE 99.

       77 SCREEN1-HANDLE
                  USAGE IS HANDLE OF WINDOW VALUE NULL.
       77 SCREEN1-MN-1-HANDLE
                  USAGE IS HANDLE OF MENU VALUE NULL.

       01 MENU-SELECTED            PIC X(10) VALUE SPACES.

       SCREEN SECTION.
       01 SCREEN1.

       PROCEDURE DIVISION.
           PERFORM ACU-SCREEN1-ROUTINE
           GOBACK.


       ACU-SCREEN1-ROUTINE.
           PERFORM ACU-SCREEN1-SCRN
           PERFORM ACU-SCREEN1-PROC.

       ACU-SCREEN1-SCRN.
           PERFORM ACU-SCREEN1-CREATE-WIN.

       ACU-SCREEN1-CREATE-WIN.
              DISPLAY STANDARD GRAPHICAL WINDOW
                 LINES 29,80, SIZE 41,50, CELL HEIGHT 10, 
                 CELL WIDTH 10, AUTO-MINIMIZE, COLOR IS 65793, 
                 LABEL-OFFSET 0, LINK TO THREAD, MODELESS, NO SCROLL, 
                 WITH SYSTEM MENU, 
                 TITLE "Menu Sample", TITLE-BAR, NO WRAP, 
                 EVENT PROCEDURE SCREEN1-EVENT-PROC, 
                 HANDLE IS SCREEN1-HANDLE

           PERFORM ACU-SCREEN1-MN-1-MENU
           MOVE MENU-HANDLE TO SCREEN1-MN-1-HANDLE
           CALL "W$MENU" USING WMENU-SHOW, SCREEN1-MN-1-HANDLE

           DISPLAY SCREEN1 UPON SCREEN1-HANDLE.


       ACU-SCREEN1-PROC.
           PERFORM UNTIL EXIT-PUSHED
              ACCEPT OMITTED LINE 1 COL 1  
                 ON EXCEPTION PERFORM ACU-SCREEN1-EVALUATE-FUNC
              END-ACCEPT
           END-PERFORM
           DESTROY SCREEN1-HANDLE
           INITIALIZE KEY-STATUS.

       ACU-SCREEN1-EVALUATE-FUNC.
           EVALUATE TRUE
              WHEN EXIT-PUSHED
                 PERFORM ACU-SCREEN1-EXIT
              WHEN EVENT-OCCURRED
                 IF EVENT-TYPE = CMD-CLOSE
                    PERFORM ACU-SCREEN1-EXIT
                 END-IF
              WHEN KEY-STATUS = 1001
                 MOVE "New" TO MENU-SELECTED
                 PERFORM NOTIFICATION
              WHEN KEY-STATUS = 1002
                 MOVE "Open" TO MENU-SELECTED
                 PERFORM NOTIFICATION
              WHEN KEY-STATUS = 1003
                 MOVE "Exit" TO MENU-SELECTED
                 PERFORM NOTIFICATION
                 PERFORM ACU-SCREEN1-EXIT
              WHEN KEY-STATUS = 1005
                 MOVE "Delete" TO MENU-SELECTED
                 PERFORM NOTIFICATION
           END-EVALUATE
           MOVE 1 TO ACCEPT-CONTROL.

       ACU-SCREEN1-EXIT.
           SET EXIT-PUSHED TO TRUE.

       ACU-SCREEN1-MN-1-MENU.
           PERFORM ACU-SCREEN1-MN-1
              THRU ACU-SCREEN1-MN-1-EXIT.

       ACU-SCREEN1-MN-1.
           CALL "W$MENU" USING WMENU-NEW GIVING MENU-HANDLE
           IF MENU-HANDLE = ZERO
              GO TO ACU-SCREEN1-MN-1-EXIT
           END-IF
           CALL "W$MENU" USING WMENU-NEW GIVING SUB-HANDLE-1
           IF SUB-HANDLE-1 = ZERO
              MOVE ZERO TO MENU-HANDLE
              GO TO ACU-SCREEN1-MN-1-EXIT
           END-IF
           CALL "W$MENU" USING WMENU-ADD, MENU-HANDLE, 0, 0, "&File", 
              1000, SUB-HANDLE-1
           CALL "W$MENU" USING WMENU-ADD, SUB-HANDLE-1, 0, 0, "&New", 
              1001
           CALL "W$MENU" USING WMENU-ADD, SUB-HANDLE-1, 0, 0, "&Open", 
              1002
           CALL "W$MENU" USING WMENU-ADD, SUB-HANDLE-1, 0, 0, "E&xit", 
              1003
           CALL "W$MENU" USING WMENU-NEW GIVING SUB-HANDLE-1
           IF SUB-HANDLE-1 = ZERO
              MOVE ZERO TO MENU-HANDLE
              GO TO ACU-SCREEN1-MN-1-EXIT
           END-IF
           CALL "W$MENU" USING WMENU-ADD, MENU-HANDLE, 0, 0, "&Edit", 
              1004, SUB-HANDLE-1
           CALL "W$MENU" USING WMENU-ADD, SUB-HANDLE-1, 0, 0, 
              "&Delete", 1005.

       ACU-SCREEN1-MN-1-EXIT.
           MOVE ZERO TO RETURN-CODE.

       ACU-SCREEN1-EVENT-EXTRA.
           EVALUATE EVENT-TYPE
           WHEN MSG-CLOSE
              PERFORM ACU-SCREEN1-MSG-CLOSE
           END-EVALUATE.

       ACU-SCREEN1-MSG-CLOSE.
           ACCEPT QUIT-MODE-FLAG FROM ENVIRONMENT "QUIT_MODE"
           IF QUIT-MODE-FLAG = ZERO
              PERFORM ACU-SCREEN1-EXIT
           END-IF.

       SCREEN1-EVENT-PROC.
           PERFORM ACU-SCREEN1-EVENT-EXTRA.
           
       NOTIFICATION.
           DISPLAY MESSAGE BOX MENU-SELECTED
           INITIALIZE MENU-SELECTED.
       
       COPY "SHOWMSG.CPY".