       IDENTIFICATION DIVISION.
       PROGRAM-ID.                      CALLER.
       AUTHOR.  MIT. 
       REMARKS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       77 PROGRAM-NAME                 PIC x(255).

       PROCEDURE DIVISION.
           ACCEPT PROGRAM-NAME FROM COMMAND-LINE
           CALL PROGRAM-NAME
           GOBACK.