       IDENTIFICATION DIVISION.
       PROGRAM-ID.
            REPORT1A.
       AUTHOR.
            SUPPORT.
       DATE-WRITTEN.
            06 AUGUST 2021 10 : 00 : 49.
       REMARKS.
            A SIMPLE REPORT CONSISTING OF 4 CHARACTER FIELDS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SALESDATA ASSIGN TO "Sales.DAT" ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC FILE STATUS IS SALESDATA-STATUS
              RECORD KEY IS SALES-KEY.
       SELECT PRINTF ASSIGN TO PRINT PTR-DEV-NAME FILE STATUS IS
              STAT-PRINTF.

       DATA DIVISION.
       FILE SECTION.
       FD SALESDATA.
       01 SALES-RECORD.
            03 SALES-KEY.
            10 SALES-STATE PIC XX.
            10 SALES-BRANCH-NO PIC X(3).
            10 SALES-NAME.
            15 SALES-LASTNAME PIC X(25).
            15 SALES-FIRSTNAME PIC X(25).
            03 SALES-GENDER PIC X.
            03 HEAVY-EQUIPMENT-SALES PIC 9(5)V99.
            03 SUPPLIES-SALES PIC 9(5)V99.
            03 SALES-QUOTA PIC 9(5)V99.
            03 NOTES OCCURS 8 TIMES.
            05 NOTE-DATE PIC X(10).
            05 NOTE-INITIALS PIC X(3).
            05 NOTE-TEXT PIC X(60).
       FD PRINTF LABEL RECORD OMITTED.
       01 PRINTF-R.
       05 PRINTF-01 PIC X OCCURS 1024 TIMES.
       WORKING-STORAGE SECTION.
       78 TEST-MOUSE-PRESENCE VALUE 0.
       78 GET-MOUSE-STATUS VALUE 1.
       78 GET-MOUSE-SCREEN-STATUS VALUE 2.
       78 SET-MOUSE-POSITION VALUE 3.
       78 SET-MOUSE-SCREEN-POSITION VALUE 4.
       78 SET-MOUSE-SHAPE VALUE 5.
       78 SET-DELAYED-MOUSE-SHAPE VALUE 6.
       78 GET-MOUSE-SHAPE VALUE 7.
       78 CAPTURE-MOUSE VALUE 8.
       78 RELEASE-MOUSE VALUE 9.
       78 ENABLE-MOUSE VALUE 10.
       78 SET-MOUSE-HELP VALUE 19.
       78 SET-MOUSE-POSITION-EX VALUE 23.
       78 SET-MOUSE-SCREEN-POSITION-EX VALUE 24.
       78 SET-MOUSE-POSITION-PIXEL VALUE 25.
       78 SET-MOUSE-SCREEN-POSITION-PIXEL VALUE 26.
       01 MOUSE-INFO.
            03 MOUSE-ROW PIC XX COMP-X.
            88 MOUSE-OFF-SCREEN VALUE ZERO.
            03 MOUSE-COL PIC XX COMP-X.
            03 LBUTTON-STATUS PIC 9.
            88 LBUTTON-DOWN VALUE 1.
            03 MBUTTON-STATUS PIC 9.
            88 MBUTTON-DOWN VALUE 1.
            03 RBUTTON-STATUS PIC 9.
            88 RBUTTON-DOWN VALUE 1.
            03 MOUSE-ROW-EX PIC 9(6)V99 COMP-4 SYNC.
            03 MOUSE-COL-EX PIC 9(6)V99 COMP-4.
            03 MOUSE-ROW-PIXEL PIC 9(8) COMP-4.
            03 MOUSE-COL-PIXEL PIC 9(8) COMP-4.
       78 ARROW-POINTER VALUE 1.
       78 BAR-POINTER VALUE 2.
       78 CROSS-POINTER VALUE 3.
       78 WAIT-POINTER VALUE 4.
       78 HELP-POINTER VALUE 5.
       78 AUTO-MOUSE-HANDLING VALUE 1.
       78 ALLOW-LEFT-DOWN VALUE 2.
       78 ALLOW-LEFT-UP VALUE 4.
       78 ALLOW-LEFT-DOUBLE VALUE 8.
       78 ALLOW-MIDDLE-DOWN VALUE 16.
       78 ALLOW-MIDDLE-UP VALUE 32.
       78 ALLOW-MIDDLE-DOUBLE VALUE 64.
       78 ALLOW-RIGHT-DOWN VALUE 128.
       78 ALLOW-RIGHT-UP VALUE 256.
       78 ALLOW-RIGHT-DOUBLE VALUE 512.
       78 ALLOW-MOUSE-MOVE VALUE 1024.
       78 ALWAYS-ARROW-CURSOR VALUE 2048.
       78 ALLOW-ALL-SCREEN-ACTIONS VALUE 16384.
       78 WMENU-NEW VALUE 1.
       78 WMENU-DESTROY VALUE 2.
       78 WMENU-ADD VALUE 3.
       78 WMENU-CHANGE VALUE 4.
       78 WMENU-DELETE VALUE 5.
       78 WMENU-CHECK VALUE 6.
       78 WMENU-UNCHECK VALUE 7.
       78 WMENU-ENABLE VALUE 8.
       78 WMENU-DISABLE VALUE 9.
       78 WMENU-SHOW VALUE 10.
       78 WMENU-GET-MENU VALUE 11.
       78 WMENU-INPUT VALUE 12.
       78 WMENU-BLOCK VALUE 13.
       78 WMENU-UNBLOCK VALUE 14.
       78 WMENU-GET-BLOCK VALUE 15.
       78 WMENU-SET-BLOCK VALUE 16.
       78 WMENU-RELEASE VALUE 17.
       78 WMENU-GET-CONFIGURATION VALUE 18.
       78 WMENU-SET-CONFIGURATION VALUE 19.
       78 WMENU-REFRESH VALUE 20.
       78 WMENU-DESTROY-DELAYED VALUE 21.
       78 WMENU-GET-DELAYED-FLAG VALUE 22.
       78 WMENU-SET-DELAYED-FLAG VALUE 23.
       78 WMENU-NEW-POPUP VALUE 26.
       78 WMENU-POPUP VALUE 27.
       78 W-UNCHECKED VALUE 0.
       78 W-CHECKED VALUE 1.
       78 W-ENABLED VALUE 0.
       78 W-DISABLED VALUE 16.
       78 W-SEPARATOR VALUE 256.
       01 MENU-CONFIGURATION.
            03 MENU-STYLE PIC 9 COMP-X.
            88 MENU-IS-STATIC VALUE 0.
            88 MENU-IS-POPUP VALUE 1.
            03 MENU-CHECK-MARK PIC X.
            03 MENU-SUBMENU-MARK PIC X.
            03 MENU-COLOR-ATTRIBUTES.
            05 MENU-NORMAL-COLOR-ATTRIBUTES.
            07 MENU-NORMAL-COLOR PIC 9(4) COMP-X.
            07 MENU-NORMAL-COLOR-KEY-1 PIC 9(4) COMP-X.
            07 MENU-NORMAL-COLOR-KEY-2 PIC 9(4) COMP-X.
            05 MENU-SELECTED-COLOR-ATTRIBUTES.
            07 MENU-SELECTED-COLOR PIC 9(4) COMP-X.
            07 MENU-SELECTED-COLOR-KEY-1 PIC 9(4) COMP-X.
            07 MENU-SELECTED-COLOR-KEY-2 PIC 9(4) COMP-X.
            05 MENU-DISABLED-COLOR-ATTRIBUTES.
            07 MENU-DISABLED-COLOR PIC 9(4) COMP-X.
            07 MENU-DISABLED-COLOR-KEY-1 PIC 9(4) COMP-X.
            07 MENU-DISABLED-COLOR-KEY-2 PIC 9(4) COMP-X.
            03 MENU-MONO-ATTRIBUTES.
            05 MENU-NORMAL-MONO-ATTRIBUTES.
            07 MENU-NORMAL-MONO PIC 9(4) COMP-X.
            07 MENU-NORMAL-MONO-KEY-1 PIC 9(4) COMP-X.
            07 MENU-NORMAL-MONO-KEY-2 PIC 9(4) COMP-X.
            05 MENU-SELECTED-MONO-ATTRIBUTES.
            07 MENU-SELECTED-MONO PIC 9(4) COMP-X.
            07 MENU-SELECTED-MONO-KEY-1 PIC 9(4) COMP-X.
            07 MENU-SELECTED-MONO-KEY-2 PIC 9(4) COMP-X.
            05 MENU-DISABLED-MONO-ATTRIBUTES.
            07 MENU-DISABLED-MONO PIC 9(4) COMP-X.
            07 MENU-DISABLED-MONO-KEY-1 PIC 9(4) COMP-X.
            07 MENU-DISABLED-MONO-KEY-2 PIC 9(4) COMP-X.
       77 MENU-HANDLE PIC S9(9) COMP-4.
       77 SUB-HANDLE-1 PIC S9(9) COMP-4.
       77 SUB-HANDLE-2 PIC S9(9) COMP-4.
       77 SUB-HANDLE-3 PIC S9(9) COMP-4.
       77 SUB-HANDLE-4 PIC S9(9) COMP-4.
       78 MB-OK VALUE 1.
       78 MB-YES-NO VALUE 2.
       78 MB-OK-CANCEL VALUE 3.
       78 MB-YES-NO-CANCEL VALUE 4.
       78 MB-YES VALUE 1.
       78 MB-NO VALUE 2.
       78 MB-CANCEL VALUE 3.
       78 MB-DEFAULT-ICON VALUE 1.
       78 MB-WARNING-ICON VALUE 2.
       78 MB-ERROR-ICON VALUE 3.
       78 WBITMAP-DISPLAY VALUE 1.
       78 WBITMAP-DESTROY VALUE 2.
       78 WBITMAP-LOAD VALUE 3.
       78 WBITMAP-LOAD-IMAGELIST VALUE 5.
       78 WBITMAP-DESTROY-IMAGELIST VALUE 6.
       78 WBITMAP-CAPTURE-IMAGE VALUE 7.
       78 WBITMAP-CAPTURE-DESKTOP VALUE 8.
       78 WBITMAP-CAPTURE-CLIPBOARD VALUE 9.
       78 WBITMAP-LOAD-PICTURE VALUE 10.
       78 WBITMAP-NO-FILL VALUE 1.
       78 WBITMAP-NO-DOWNLOAD VALUE 2.
       78 WBERR-UNSUPPORTED VALUE 0.
       78 WBERR-FILE-ERROR VALUE -1.
       78 WBERR-NO-MEMORY VALUE -2.
       78 WBERR-NOT-BITMAP VALUE -3.
       78 WBERR-FORMAT-UNSUPPORTED VALUE -4.
       78 WBERR-MISSING-DLL VALUE -5.
       78 WBERR-INVALID-HWND VALUE -6.
       78 WBERR-INVALID-DATA VALUE -7.
       78 WBERR-INVALID-CLIPBOARD VALUE -8.
       78 WBERR-INVALID-PALETTE VALUE -9.
       78 WBERR-CLIPBOARD-EMPTY VALUE -10.
       78 WBERR-NOT-INITIALIZED VALUE -11.
       01 TEXTSIZE-DATA.
            03 TEXTSIZE-FONT HANDLE OF FONT VALUE NULL.
            03 TEXTSIZE-WINDOW HANDLE OF WINDOW VALUE NULL.
            03 TEXTSIZE-SIZE-X PIC 9(7)V99 COMP-4.
            03 TEXTSIZE-CELLS-X PIC 9(7)V99 COMP-4.
            03 TEXTSIZE-BASE-X PIC 9(9) COMP-4.
            03 TEXTSIZE-SIZE-Y PIC 99V99 COMP-4.
            03 TEXTSIZE-CELLS-Y PIC 99V99 COMP-4.
            03 TEXTSIZE-BASE-Y PIC 9(4) COMP-4.
            03 TEXTSIZE-FLAGS PIC X COMP-X VALUE ZERO.
            88 TEXTSIZE-STRIP-SPACES VALUE 1 FALSE ZERO.
       78 EVENT-ACTION-NORMAL VALUE ZERO.
       78 EVENT-ACTION-TERMINATE VALUE 1.
       78 EVENT-ACTION-CONTINUE VALUE 2.
       78 EVENT-ACTION-IGNORE VALUE 3.
       78 EVENT-ACTION-FAIL VALUE 4.
       78 EVENT-ACTION-COMPLETE VALUE 5.
       78 EVENT-ACTION-FAIL-TERMINATE VALUE 7.
       78 W-TIMEOUT VALUE 99.
       78 W-CONVERSION-ERROR VALUE 98.
       78 W-NO-FIELDS VALUE 97.
       78 W-EVENT VALUE 96.
       78 W-MESSAGE VALUE 95.
       78 CMD-CLOSE VALUE 1.
       78 CMD-GOTO VALUE 3.
       78 CMD-CLICKED VALUE 4.
       78 CMD-DBLCLICK VALUE 5.
       78 CMD-ACTIVATE VALUE 6.
       78 CMD-TABCHANGED VALUE 7.
       78 CMD-HELP VALUE 8.
       78 NTF-SELCHANGE VALUE 4099.
       78 NTF-CHANGED VALUE 4100.
       78 NTF-PL-NEXT VALUE 4101.
       78 NTF-PL-PREV VALUE 4102.
       78 NTF-PL-NEXTPAGE VALUE 4103.
       78 NTF-PL-PREVPAGE VALUE 4104.
       78 NTF-PL-FIRST VALUE 4105.
       78 NTF-PL-LAST VALUE 4106.
       78 NTF-PL-SEARCH VALUE 4107.
       78 NTF-PL-PREV-WHEEL VALUE 4108.
       78 NTF-PL-NEXT-WHEEL VALUE 4109.
       78 NTF-ATW-EVENT VALUE 4110.
       78 NTF-RESIZED VALUE 4114.
       78 MSG-SB-NEXT VALUE 16385.
       78 MSG-SB-PREV VALUE 16386.
       78 MSG-SB-NEXTPAGE VALUE 16387.
       78 MSG-SB-PREVPAGE VALUE 16388.
       78 MSG-SB-THUMB VALUE 16389.
       78 MSG-SB-THUMBTRACK VALUE 16390.
       78 MSG-VALIDATE VALUE 16391.
       78 MSG-BEGIN-ENTRY VALUE 16392.
       78 MSG-FINISH-ENTRY VALUE 16393.
       78 MSG-CANCEL-ENTRY VALUE 16394.
       78 MSG-GOTO-CELL VALUE 16395.
       78 MSG-GOTO-CELL-MOUSE VALUE 16396.
       78 MSG-MENU-INPUT VALUE 16397.
       78 MSG-INIT-MENU VALUE 16398.
       78 MSG-END-MENU VALUE 16399.
       78 MSG-BITMAP-CLICKED VALUE 16400.
       78 MSG-BITMAP-DBLCLICK VALUE 16401.
       78 MSG-HEADING-CLICKED VALUE 16402.
       78 MSG-HEADING-DBLCLICK VALUE 16403.
       78 MSG-GOTO-CELL-DRAG VALUE 16404.
       78 MSG-HEADING-DRAGGED VALUE 16405.
       78 MSG-BEGIN-DRAG VALUE 16406.
       78 MSG-END-DRAG VALUE 16407.
       78 MSG-BEGIN-HEADING-DRAG VALUE 16408.
       78 MSG-END-HEADING-DRAG VALUE 16409.
       78 MSG-COL-WIDTH-CHANGED VALUE 16410.
       78 MSG-TV-SELCHANGING VALUE 16411.
       78 MSG-TV-SELCHANGE VALUE 16412.
       78 MSG-TV-EXPANDING VALUE 16413.
       78 MSG-TV-EXPANDED VALUE 16414.
       78 MSG-CLOSE VALUE 16415.
       78 MSG-SPIN-UP VALUE 16416.
       78 MSG-SPIN-DOWN VALUE 16417.
       78 MSG-PAGED-NEXT VALUE 16419.
       78 MSG-PAGED-PREV VALUE 16420.
       78 MSG-PAGED-NEXTPAGE VALUE 16421.
       78 MSG-PAGED-PREVPAGE VALUE 16422.
       78 MSG-PAGED-FIRST VALUE 16423.
       78 MSG-PAGED-LAST VALUE 16424.
       78 MSG-GRID-RBUTTON-DOWN VALUE 16426.
       78 MSG-GRID-RBUTTON-UP VALUE 16427.
       78 MSG-TV-DBLCLICK VALUE 16428.
       78 MSG-WB-BEFORE-NAVIGATE VALUE 16429.
       78 MSG-WB-NAVIGATE-COMPLETE VALUE 16430.
       78 MSG-WB-DOWNLOAD-BEGIN VALUE 16431.
       78 MSG-WB-DOWNLOAD-COMPLETE VALUE 16432.
       78 MSG-WB-PROGRESS-CHANGE VALUE 16433.
       78 MSG-WB-STATUS-TEXT-CHANGE VALUE 16434.
       78 MSG-WB-TITLE-CHANGE VALUE 16435.
       78 MSG-AX-EVENT VALUE 16436.
       78 MSG-NET-EVENT VALUE 16437.
       78 MSG-PAGED-PREV-WHEEL VALUE 16438.
       78 MSG-PAGED-NEXT-WHEEL VALUE 16439.
       78 MSG-TV-BEGINEDITLABEL VALUE 16440.
       78 MSG-TV-ENDEDITLABEL VALUE 16441.
       78 MSG-BEGIN-SORT VALUE 16442.
       78 MSG-FINISH-SORT VALUE 16443.
       78 MSG-COLUMN-MOVED VALUE 16444.
       78 MSG-COLUMN-SHOW VALUE 16445.
       78 WHEEL-PAGESCROLL VALUE -1.
       78 ACTION-CUT VALUE 1.
       78 ACTION-COPY VALUE 2.
       78 ACTION-PASTE VALUE 3.
       78 ACTION-DELETE VALUE 4.
       78 ACTION-UNDO VALUE 5.
       78 ACTION-SELECT-ALL VALUE 6.
       78 ACTION-FIRST-PAGE VALUE 10.
       78 ACTION-LAST-PAGE VALUE 11.
       78 ACTION-CURRENT-PAGE VALUE 12.
       78 ACTION-HIDE-DRAG VALUE 13.
       78 ACTION-PREVIOUS VALUE 14.
       78 ACTION-PREVIOUS-PAGE VALUE 15.
       78 ACTION-NEXT-PAGE VALUE 16.
       78 ACTION-NEXT VALUE 17.
       78 ACTION-MINIMIZE VALUE 20.
       78 ACTION-MAXIMIZE VALUE 21.
       78 ACTION-RESTORE VALUE 22.
       78 PAGED-AT-START VALUE 2147418113.
       78 PAGED-AT-END VALUE 2147418114.
       78 PAGED-EMPTY VALUE 2147418115.
       01 GRID-SEARCH-OPTIONS VALUE ALL ZEROS.
            03 GRID-SEARCH-DIRECTION PIC 9.
            88 GRID-SEARCH-FORWARDS VALUE ZERO FALSE 1.
            03 GRID-SEARCH-WRAP-FLAG PIC 9.
            88 GRID-SEARCH-WRAP VALUE ZERO FALSE 1.
            03 GRID-SEARCH-CASE-FLAG PIC 9.
            88 GRID-SEARCH-IGNORE-CASE VALUE ZERO FALSE 1.
            03 GRID-SEARCH-MATCH-FLAG PIC 9.
            88 GRID-SEARCH-MATCH-ANY VALUE ZERO.
            88 GRID-SEARCH-MATCH-LEADING VALUE 1.
            88 GRID-SEARCH-MATCH-ALL VALUE 2.
            03 GRID-SEARCH-LOCATION-FLAG PIC 9.
            88 GRID-SEARCH-VISIBLE VALUE ZERO.
            88 GRID-SEARCH-HIDDEN VALUE 1.
            88 GRID-SEARCH-ALL-DATA VALUE 2.
            03 GRID-SEARCH-SKIP-FLAG PIC 9.
            88 GRID-SEARCH-SKIP-CURRENT VALUE ZERO FALSE 1.
            03 GRID-SEARCH-CURSOR-FLAG PIC 9.
            88 GRID-SEARCH-MOVES-CURSOR VALUE ZERO FALSE 1.
            03 GRID-SEARCH-COLUMN PIC 9(5).
            88 GRID-SEARCH-ALL-COLUMNS VALUE ZERO.
       78 GRDSRCH-NOT-FOUND VALUE 0.
       78 GRDSRCH-FOUND VALUE 1.
       78 GRDSRCH-WRAPPED VALUE 2.
       78 GRFR-BLANK-PAST-END VALUE -1.
       78 GRFR-TERMINATING VALUE -2.
       78 GRFR-CELL-CLICKED VALUE -3.
       78 GRFR-NAVIGATION-KEY VALUE -4.
       78 GRFR-ESCAPE-KEY VALUE -5.
       78 GRFR-ENTER-KEY VALUE -6.
       78 GRFR-TAB-KEY VALUE -7.
       78 GRID-FIRST-VISIBLE-COLUMN VALUE -1.
       78 SND-SYNC VALUE 0.
       78 SND-ASYNC VALUE 1.
       78 SND-LOOP VALUE 8.
       78 SND-NOSTOP VALUE 16.
       78 TVPLACE-FIRST VALUE 4294901761.
       78 TVPLACE-LAST VALUE 0.
       78 TVPLACE-SORT VALUE 4294901763.
       78 TVNI-CHILD VALUE 1.
       78 TVNI-FIRST-VISIBLE VALUE 2.
       78 TVNI-NEXT VALUE 3.
       78 TVNI-NEXT-VISIBLE VALUE 4.
       78 TVNI-PARENT VALUE 5.
       78 TVNI-PREVIOUS VALUE 6.
       78 TVNI-PREVIOUS-VISIBLE VALUE 7.
       78 TVNI-ROOT VALUE 8.
       78 TVFLAG-COLLAPSE VALUE 1.
       78 TVFLAG-EXPAND VALUE 2.
       78 TVFLAG-PROGRAM VALUE ZERO.
       78 TVFLAG-MOUSE VALUE 1.
       78 TVFLAG-KEYBOARD VALUE 2.
       78 TVFLAG-NORMAL VALUE 1.
       78 TVFLAG-BOLD VALUE 2.
       78 PL-SORT-DEFAULT VALUE 0.
       78 PL-SORT-NONE VALUE 1.
       78 PL-SORT-NATIVE VALUE 2.
       78 PL-SORT-NATIVE-IGNORE-CASE VALUE 3.
       78 DAVF-YYYYMMDD VALUE 0.
       78 DAVF-YYMMDD VALUE 1.
       78 DAVF-HHMMSSHH VALUE 2.
       78 DAVF-HHMMSS VALUE 3.
       78 DAVF-YYYYMMDDHHMMSSHH VALUE 4.
       78 BM-CORNER-COLOR VALUE 16777216.
       78 HKEY-CLASSES-ROOT-31 VALUE 1.
       78 HKEY-CLASSES-ROOT VALUE 2147483648.
       78 HKEY-CURRENT-USER VALUE 2147483649.
       78 HKEY-LOCAL-MACHINE VALUE 2147483650.
       78 HKEY-USERS VALUE 2147483651.
       78 HKEY-PERFORMANCE-DATA VALUE 2147483652.
       78 HKEY-CURRENT-CONFIG VALUE 2147483653.
       78 HKEY-DYN-DATA VALUE 2147483654.
       78 REG-NONE VALUE ZERO.
       78 REG-SZ VALUE 1.
       78 REG-EXPAND-SZ VALUE 2.
       78 REG-BINARY VALUE 3.
       78 REG-DWORD VALUE 4.
       78 REG-DWORD-LITTLE-ENDIAN VALUE 4.
       78 REG-DWORD-BIG-ENDIAN VALUE 5.
       78 REG-LINK VALUE 6.
       78 REG-MULTI-SZ VALUE 7.
       78 REG-RESOURCE-LIST VALUE 8.
       78 REG-FULL-RESOURCE-DESCRIPTOR VALUE 9.
       78 REG-RESOURCE-REQUIREMENTS-LIST VALUE 10.
       01 WIN32-REGISTRY-VALUE-TYPE USAGE IS UNSIGNED-LONG.
            88 TYPE-IS-REG-NONE VALUE ZERO.
            88 TYPE-IS-REG-SZ VALUE 1.
            88 TYPE-IS-REG-EXPAND-SZ VALUE 2.
            88 TYPE-IS-REG-BINARY VALUE 3.
            88 TYPE-IS-REG-DWORD VALUE 4.
            88 TYPE-IS-REG-DWORD-LITTLE-ENDIAN VALUE 4.
            88 TYPE-IS-REG-DWORD-BIG-ENDIAN VALUE 5.
            88 TYPE-IS-REG-LINK VALUE 6.
            88 TYPE-IS-REG-MULTI-SZ VALUE 7.
            88 TYPE-IS-REG-RESOURCE-LIST VALUE 8.
            88 TYPE-IS-REG-FULL-RESOURCE-DESCRIPTOR VALUE 9.
            88 TYPE-IS-REG-RESOURCE-REQUIREMENTS-LIST VALUE 10.
       78 REG-OPTION-NON-VOLATILE VALUE 0.
       78 REG-OPTION-VOLATILE VALUE 1.
       78 KEY-QUERY-VALUE VALUE 1.
       78 KEY-SET-VALUE VALUE 2.
       78 KEY-CREATE-SUB-KEY VALUE 4.
       78 KEY-ENUMERATE-SUB-KEYS VALUE 8.
       78 KEY-NOTIFY VALUE 16.
       78 KEY-CREATE-LINK VALUE 32.
       78 KEY-WRITE VALUE 131078.
       78 KEY-READ VALUE 131097.
       78 KEY-EXECUTE VALUE 131097.
       78 KEY-ALL-ACCESS VALUE 983103.
       78 REG-CREATED-NEW-KEY VALUE 1.
       78 REG-OPENED-EXISTING-KEY VALUE 2.
       78 WPROGRESSDIALOG-CREATE VALUE 1.
       78 WPROGRESSDIALOG-DESTROY VALUE 2.
       78 WPROGRESSDIALOG-SET-PROGRESS VALUE 3.
       78 WPROGRESSDIALOG-QUERY-CANCEL VALUE 4.
       78 WPROGRESSDIALOG-SET-LINE VALUE 5.
       78 WPROGRESSDIALOG-RESET-TIMER VALUE 6.
       78 WPROGRESSDIALOG-C-COPY VALUE 7.
       78 WPROGRESSDIALOG-NORMAL VALUE 0.
       78 WPROGRESSDIALOG-MODAL VALUE 1.
       78 WPROGRESSDIALOG-AUTOTIME VALUE 2.
       78 WPROGRESSDIALOG-NOTIME VALUE 4.
       78 WPROGRESSDIALOG-NOMINIMIZE VALUE 8.
       78 WPROGRESSDIALOG-NOPROGRESSBAR VALUE 16.
       78 WPROGRESSDIALOG-ANIMATION-NONE VALUE 0.
       78 WPROGRESSDIALOG-ANIMATION-FILECOPY VALUE 1.
       78 WPROGRESSDIALOG-ANIMATION-FILEMOVE VALUE 2.
       78 WPROGRESSDIALOG-ANIMATION-FILEDEL VALUE 3.
       78 WPROGRESSDIALOG-ANIMATION-FILEDELR VALUE 4.
       78 WPROGRESSDIALOG-ANIMATION-FILENUKE VALUE 5.
       78 WPROGRESSDIALOG-ANIMATION-SEARCH VALUE 6.
       78 WPROGRESSDIALOG-ANIMATION-FINDCOMP VALUE 7.
       78 WPROGRESSDIALOG-ANIMATION-FINDFILE VALUE 8.
       78 WPROGRESSDIALOG-ANIMATION-CUSTOM VALUE 99.
       01 TERMINAL-ABILITIES.
            03 TERMINAL-NAME PIC X(10).
            03 FILLER PIC X.
            88 HAS-REVERSE VALUE "Y".
            03 FILLER PIC X.
            88 HAS-BLINK VALUE "Y".
            03 FILLER PIC X.
            88 HAS-UNDERLINE VALUE "Y".
            03 FILLER PIC X.
            88 HAS-DUAL-INTENSITY VALUE "Y".
            03 FILLER PIC X.
            88 HAS-132-COLUMN-MODE VALUE "Y".
            03 FILLER PIC X.
            88 HAS-COLOR VALUE "Y".
            03 FILLER PIC X.
            88 HAS-LINE-DRAWING VALUE "Y".
            03 NUMBER-OF-SCREEN-LINES PIC 9(3).
            03 NUMBER-OF-SCREEN-COLUMNS PIC 9(3).
            03 FILLER PIC X.
            88 HAS-LOCAL-PRINTER VALUE "Y".
            03 FILLER PIC X.
            88 HAS-VISIBLE-ATTRIBUTES VALUE "Y".
            03 FILLER PIC X.
            88 HAS-GRAPHICAL-INTERFACE VALUE "Y".
            03 USABLE-SCREEN-HEIGHT PIC X(2) COMP-X.
            03 USABLE-SCREEN-WIDTH PIC X(2) COMP-X.
            03 PHYSICAL-SCREEN-HEIGHT PIC X(2) COMP-X.
            03 PHYSICAL-SCREEN-WIDTH PIC X(2) COMP-X.
            03 FILLER PIC X.
            88 IS-REMOTE VALUE "Y".
            03 CLIENT-MACHINE-NAME PIC X(64).
            03 FILLER PIC X.
            88 ACU-NO-TERMINAL VALUE "Y".
            03 CLIENT-USER-ID PIC X(20).
            03 ATW-INFO.
            05 ATW-BROWSER-NAME PIC X(30).
            05 ATW-BROWSER-VERSION PIC X(10).
            05 ATW-ENGINE-NAME PIC X(30).
            05 ATW-ENGINE-VERSION PIC X(10).
            05 ATW-CLIENT-OS-NAME PIC X(30).
            05 ATW-CLIENT-OS-VERSION PIC X(10).
            05 ATW-CLIENT-DEVICE-TYPE PIC X(30).
            05 ATW-CLIENT-DEVICE-VENDOR PIC X(30).
            05 ATW-CLIENT-DEVICE-MODEL PIC X(30).
            05 PIC X(154).
            78 MAX-MONITORS VALUE 10.
            03 MONITOR-INFO REDEFINES ATW-INFO.
            05 MONITOR-COUNT PIC 99.
            05 ONE-MONITOR-INFO OCCURS MAX-MONITORS TIMES.
            07 OMI-PHYSICAL.
            09 OMIP-LEFT SIGNED-INT.
            09 OMIP-TOP SIGNED-INT.
            09 OMIP-RIGHT SIGNED-INT.
            09 OMIP-BOTTOM SIGNED-INT.
            07 OMI-WORK.
            09 OMIW-LEFT SIGNED-INT.
            09 OMIW-TOP SIGNED-INT.
            09 OMIW-RIGHT SIGNED-INT.
            09 OMIW-BOTTOM SIGNED-INT.
            07 OMI-FLAGS SIGNED-INT.
            88 IS-PRIMARY-MONITOR VALUE 1.
       01 SYSTEM-INFORMATION.
            03 OPERATING-SYSTEM PIC X(10).
            88 OS-IS-MSDOS VALUE "MS-DOS".
            88 OS-IS-OS2 VALUE "OS/2".
            88 OS-IS-VMS VALUES "VMS" "VAX/VMS".
            88 OS-IS-UNIX VALUES "Unix" "Unix-V" "Unix-4" "UNOS".
            88 OS-IS-AOS VALUE "AOS/VS".
            88 OS-IS-WINDOWS VALUE "WINDOWS".
            88 OS-IS-WIN-NT VALUE "WIN/NT".
            88 OS-IS-WIN-FAMILY VALUES "WINDOWS" "WIN/NT".
            88 OS-IS-AMOS VALUE "AMOS".
            88 OS-IS-MPE VALUE "MPE/iX".
            88 OS-IS-MPEIX VALUE "MPE/iX".
            03 USER-ID PIC X(12).
            03 STATION-ID PIC X(12).
            03 FILLER PIC X.
            88 HAS-INDEXED-READ-PREVIOUS VALUE "Y".
            03 FILLER PIC X.
            88 HAS-RELATIVE-READ-PREVIOUS VALUE "Y".
            03 FILLER PIC X.
            88 CAN-TEST-INPUT-STATUS VALUE "Y".
            03 FILLER PIC X.
            88 IS-MULTI-TASKING VALUE "Y".
            03 RUNTIME-VERSION.
            88 VERSION-PRIOR-TO-2-2 VALUE SPACES.
            05 RUNTIME-MAJOR-VERSION PIC 99.
            05 RUNTIME-MINOR-VERSION PIC 99.
            05 RUNTIME-RELEASE PIC 99.
            03 FILLER PIC X.
            88 IS-PLUGIN VALUE "Y".
            03 SERIAL-NUMBER PIC X(20).
            03 FILLER PIC X.
            88 HAS-LARGE-FILE-SUPPORT VALUE "Y".
            03 FILLER PIC X.
            88 HAS-BIS-SUPPORT VALUE "Y".
            03 FILLER PIC X.
            88 IS-64-BIT VALUE "Y".
       01 BROWSERINFO-DATA.
            03 USER-AGENT-STRING PIC X(50).
            03 BROWSER-MAJOR-VERSION PIC X COMP-X.
            03 BROWSER-MINOR-VERSION PIC X COMP-X.
       78 BLACK VALUE 1.
       78 BLUE VALUE 2.
       78 GREEN VALUE 3.
       78 CYAN VALUE 4.
       78 RED VALUE 5.
       78 MAGENTA VALUE 6.
       78 BROWN VALUE 7.
       78 WHITE VALUE 8.
       78 DARK-GRAY VALUE 9.
       78 BRIGHT-BLUE VALUE 10.
       78 BRIGHT-GREEN VALUE 11.
       78 BRIGHT-CYAN VALUE 12.
       78 BRIGHT-RED VALUE 13.
       78 BRIGHT-MAGENTA VALUE 14.
       78 YELLOW VALUE 15.
       78 BRIGHT-WHITE VALUE 16.
       78 BCKGRND-BLACK VALUE 32.
       78 BCKGRND-BLUE VALUE 64.
       78 BCKGRND-GREEN VALUE 96.
       78 BCKGRND-CYAN VALUE 128.
       78 BCKGRND-RED VALUE 160.
       78 BCKGRND-MAGENTA VALUE 192.
       78 BCKGRND-BROWN VALUE 224.
       78 BCKGRND-WHITE VALUE 256.
       78 BCKGRND-DARK-GRAY VALUE 288.
       78 BCKGRND-BRIGHT-BLUE VALUE 320.
       78 BCKGRND-BRIGHT-GREEN VALUE 352.
       78 BCKGRND-BRIGHT-CYAN VALUE 384.
       78 BCKGRND-BRIGHT-RED VALUE 416.
       78 BCKGRND-BRIGHT-MAGENTA VALUE 448.
       78 BCKGRND-YELLOW VALUE 480.
       78 BCKGRND-BRIGHT-WHITE VALUE 512.
       78 COLOR-REVERSE VALUE 1024.
       78 FRGRND-LOW VALUE 2048.
       78 FRGRND-HIGH VALUE 4096.
       78 COLOR-UNDERLINE VALUE 8192.
       78 COLOR-BLINK VALUE 16384.
       78 COLOR-PROTECTED VALUE 32768.
       78 BCKGRND-LOW VALUE 65536.
       78 BCKGRND-HIGH VALUE 131072.
       78 WINDOW-BRIGHT-WHITE VALUE 131328.
       78 GET-FILE-STATUS VALUE 1.
       78 GET-TRANSACTION-STATUS VALUE 2.
       78 START-FILESYSTEM-LIST VALUE 0.
       78 CONTINUE-FILESYSTEM-LIST VALUE 1.
       78 CHECK-FOR-FILESYSTEM VALUE 2.
       78 NUMBER-OF-FILESYSTEMS VALUE 3.
       77 FILESYSTEM PIC X(5).
       78 CSYS-ASYNC VALUE 1.
       78 CSYS-NO-IO VALUE 2.
       78 CSYS-MAXIMIZED VALUE 4.
       78 CSYS-MINIMIZED VALUE 8.
       78 CSYS-COMPATIBILITY VALUE 16.
       78 CSYS-HIDDEN VALUE 32.
       78 CSYS-SHELL VALUE 64.
       78 CSYS-DESKTOP VALUE 128.
       78 CPING-OK VALUE 0.
       78 CPING-NO-CLIENT VALUE 1.
       78 CPING-PARAM-ERROR VALUE 2.
       78 CPING-CONN-REFUSED VALUE 3.
       78 CPING-VERSION-ERROR VALUE 4.
       78 CPING-SOCKET-ERROR VALUE 5.
       78 LISTDIR-OPEN VALUE 1.
       78 LISTDIR-NEXT VALUE 2.
       78 LISTDIR-CLOSE VALUE 3.
       01 LISTDIR-FILE-INFORMATION.
            03 LISTDIR-FILE-TYPE PIC X.
            88 LISTDIR-FILE-TYPE-BLOCK-DEVICE VALUE "B".
            88 LISTDIR-FILE-TYPE-CHARACTER-DEVICE VALUE "C".
            88 LISTDIR-FILE-TYPE-DIRECTORY VALUE "D".
            88 LISTDIR-FILE-TYPE-REGULAR-FILE VALUE "F".
            88 LISTDIR-FILE-TYPE-PIPE VALUE "P".
            88 LISTDIR-FILE-TYPE-SOCKET VALUE "S".
            88 LISTDIR-FILE-TYPE-UNKNOWN VALUE "U".
            03 LISTDIR-FILE-CREATION-TIME.
            05 LDFC-YEAR PIC XX COMP-X.
            05 LDFC-MONTH PIC X COMP-X.
            05 LDFC-DAY PIC X COMP-X.
            05 LDFC-HOUR PIC X COMP-X.
            05 LDFC-MINUTE PIC X COMP-X.
            05 LDFC-SECOND PIC X COMP-X.
            05 LDFC-HUNDRETHS PIC X COMP-X.
            03 LISTDIR-FILE-LAST-ACCESS-TIME.
            05 LDFLA-YEAR PIC XX COMP-X.
            05 LDFLA-MONTH PIC X COMP-X.
            05 LDFLA-DAY PIC X COMP-X.
            05 LDFLA-HOUR PIC X COMP-X.
            05 LDFLA-MINUTE PIC X COMP-X.
            05 LDFLA-SECOND PIC X COMP-X.
            05 LDFLA-HUNDRETHS PIC X COMP-X.
            03 LISTDIR-FILE-LAST-MODIFICATION-TIME.
            05 LDFLM-YEAR PIC XX COMP-X.
            05 LDFLM-MONTH PIC X COMP-X.
            05 LDFLM-DAY PIC X COMP-X.
            05 LDFLM-HOUR PIC X COMP-X.
            05 LDFLM-MINUTE PIC X COMP-X.
            05 LDFLM-SECOND PIC X COMP-X.
            05 LDFLM-HUNDRETHS PIC X COMP-X.
            03 LISTDIR-FILE-SIZE PIC X(8) COMP-X.
       78 CXML-PARSE-FILE VALUE 1.
       78 CXML-RELEASE-PARSER VALUE 2.
       78 CXML-GET-FIRST-CHILD VALUE 3.
       78 CXML-GET-NEXT-SIBLING VALUE 4.
       78 CXML-GET-PARENT VALUE 5.
       78 CXML-GET-DATA VALUE 6.
       78 CXML-GET-ATTRIBUTE-COUNT VALUE 7.
       78 CXML-GET-ATTRIBUTE VALUE 8.
       78 CXML-GET-LAST-ERROR VALUE 9.
       78 CXML-OPEN-FILE VALUE 10.
       78 CXML-PARSE-STRING VALUE 11.
       78 CXML-PARSE-NEXT-RECORD VALUE 12.
       78 CXML-GET-PREV-SIBLING VALUE 13.
       78 CXML-NEW-PARSER VALUE 14.
       78 CXML-GET-ATTRIBUTE-BY-NAME VALUE 15.
       78 CXML-GET-CHILD-BY-NAME VALUE 16.
       78 CXML-GET-CHILD-BY-CDATA VALUE 17.
       78 CXML-GET-CHILD-BY-ATTR-NAME VALUE 18.
       78 CXML-GET-CHILD-BY-ATTR-VALUE VALUE 19.
       78 CXML-GET-SIBLING-BY-NAME VALUE 20.
       78 CXML-GET-SIBLING-BY-CDATA VALUE 21.
       78 CXML-GET-SIBLING-BY-ATTR-NAME VALUE 22.
       78 CXML-GET-SIBLING-BY-ATTR-VALUE VALUE 23.
       78 CXML-GET-COMMENT VALUE 24.
       78 CXML-SET-DATA VALUE 25.
       78 CXML-MODIFY-ATTRIBUTE-VALUE VALUE 26.
       78 CXML-ADD-CHILD VALUE 27.
       78 CXML-ADD-SIBLING VALUE 28.
       78 CXML-ADD-ATTRIBUTE VALUE 29.
       78 CXML-ADD-COMMENT VALUE 30.
       78 CXML-APPEND-COMMENT VALUE 31.
       78 CXML-DELETE-ATTRIBUTE VALUE 32.
       78 CXML-DELETE-ELEMENT VALUE 33.
       78 CXML-DELETE-COMMENT VALUE 34.
       78 CXML-WRITE-FILE VALUE 35.
       78 CXML-GET-PROC-INSTR-COUNT VALUE 36.
       78 CXML-GET-PROC-INSTR VALUE 37.
       78 CXML-SET-PROC-INSTR VALUE 38.
       78 CXML-GET-VERSION VALUE 39.
       78 CXML-SET-VERSION VALUE 40.
       78 CXML-GET-ENCODING VALUE 41.
       78 CXML-SET-ENCODING VALUE 42.
       78 CXML-GET-STANDALONE VALUE 43.
       78 CXML-SET-STANDALONE VALUE 44.
       78 CXML-GET-RAW-DOCTYPE-LEN VALUE 45.
       78 CXML-GET-RAW-DOCTYPE VALUE 46.
       78 CXML-SET-RAW-DOCTYPE VALUE 47.
       78 CXML-WRITE-STRING VALUE 48.
       78 CXML-NO-MEMORY VALUE 1.
       78 CXML-EXPAT-ERROR VALUE 2.
       78 CXML-FILE-OPEN-ERROR VALUE 3.
       78 CXML-PARSE-ERROR VALUE 4.
       78 CXML-INVALID-PARSER-HANDLE VALUE 5.
       78 CXML-INVALID-ELEMENT-HANDLE VALUE 6.
       78 CXML-INVALID-ATTRIBUTE-NUMBER VALUE 7.
       78 CXML-URL-ERROR VALUE 8.
       78 CXML-NOT-AVAILABLE VALUE 9.
       78 CXML-NO-CHILDREN VALUE 10.
       78 CXML-NO-SIBLINGS VALUE 11.
       78 CXML-NO-PARENT VALUE 12.
       78 CXML-NO-VALUE VALUE 13.
       78 CXML-NO-ATTRIBUTES VALUE 14.
       78 CXML-REGEXP-ERROR VALUE 15.
       78 CXML-TOP-LEVEL VALUE 16.
       78 CXML-INVALID-PROC-INSTR-NUMBER VALUE 17.
       78 CXML-NO-PROCESSING-INSTRUCTIONS VALUE 18.
       78 CCONFIG-RESET VALUE 1.
       78 AREGEXP-GET-LEVEL VALUE 1.
       78 AREGEXP-COMPILE VALUE 2.
       78 AREGEXP-MATCH VALUE 3.
       78 AREGEXP-RELEASE-MATCH VALUE 4.
       78 AREGEXP-RELEASE VALUE 5.
       78 AREGEXP-NUMGROUPS VALUE 6.
       78 AREGEXP-GETMATCH VALUE 7.
       78 AREGEXP-LAST-ERROR VALUE 20.
       78 AREGEXP-COMPILE-IGNORECASE VALUE 1.
       78 AREGEXP-COMPILE-BASIC VALUE 2.
       78 AREGEXP-COMPILE-NO-SPECIAL VALUE 4.
       78 AREGEXP-COMPILE-NO-SUB VALUE 8.
       78 AREGEXP-COMPILE-NEWLINE VALUE 16.
       78 AREGEXP-COMPILE-NO-REGEXP VALUE 32.
       78 AREGEXP-ERROR-NO-ERROR VALUE 0.
       78 AREGEXP-ERROR-NO-MEMORY VALUE 1.
       78 AREGEXP-ERROR-BRACE-EXPECTED VALUE 2.
       78 AREGEXP-ERROR-PAREN-EXPECTED VALUE 3.
       78 AREGEXP-ERROR-BRACKET-EXPECTED VALUE 4.
       78 AREGEXP-ERROR-UNEXPECTED VALUE 5.
       78 AREGEXP-ERROR-EMPTY-RANGE VALUE 6.
       78 AREGEXP-ERROR-INVALID-GROUP VALUE 7.
       78 AREGEXP-ERROR-INVALID-RANGE VALUE 8.
       78 AREGEXP-ERROR-EMPTY-REPEATOP VALUE 9.
       78 AREGEXP-ERROR-INVALID-INPUT VALUE 10.
       78 AREGEXP-ERROR-INVALID-HANDLE VALUE 11.
       78 AREGEXP-ERROR-INVALID-ARGUMENT VALUE 12.
       78 AREGEXP-ERROR-INVALID-CALL-SEQ VALUE 13.
       78 AREGEXP-ERROR-NO-MATCH VALUE 14.
       78 AREGEXP-NONE VALUE 0.
       78 AREGEXP-WINDOWS VALUE 1.
       78 AREGEXP-POSIX VALUE 2.
       78 CSYSLOG-OPEN VALUE 0.
       78 CSYSLOG-WRITE VALUE 1.
       78 CSYSLOG-CLOSE VALUE 2.
       78 CSYSLOG-PRIORITY-SUCCESS VALUE 0.
       78 CSYSLOG-PRIORITY-INFORMATION VALUE 1.
       78 CSYSLOG-PRIORITY-WARNING VALUE 2.
       78 CSYSLOG-PRIORITY-ERROR VALUE 3.
       01 EVENT-STATUS IS SPECIAL-NAMES EVENT STATUS.
            03 EVENT-TYPE PIC X(4) COMP-X.
            03 EVENT-WINDOW-HANDLE HANDLE OF WINDOW.
            03 EVENT-CONTROL-HANDLE HANDLE.
            03 EVENT-CONTROL-ID PIC XX COMP-X.
            03 EVENT-DATA-1 SIGNED-SHORT.
            03 EVENT-DATA-2 SIGNED-LONG.
            03 EVENT-ACTION PIC X COMP-X.
       01 SCREEN-CONTROL IS SPECIAL-NAMES SCREEN CONTROL.
            03 ACCEPT-CONTROL PIC 9.
            03 CONTROL-VALUE PIC 999.
            03 CONTROL-HANDLE HANDLE.
            03 CONTROL-ID PIC XX COMP-X.
       01 ACU-PRINT-VARIABLE.
            05 ACU-PAGENUM PIC 9(06) VALUE 0.
            05 ACU-PAGENUM-SYS PIC 9(06) VALUE 0.
            05 ACU-SETUPPRINT PIC 9 VALUE 0.
            05 ACU-STATUS-CODE PIC 9 VALUE 0.
            05 ACU-PRINTER-NAME PIC X(125) VALUE SPACES.
            05 ACU-PAPER-SIZE PIC X(20) VALUE SPACES.
            05 ACU-PAPER-SIZEINT.
            10 ACU-PAPER-WIDTH PIC 9(6).
            10 FILLER PIC X VALUE IS "|".
            10 ACU-PAPER-HEIGHT PIC 9(6).
            10 FILLER PIC X VALUE IS " ".
            05 ACU-PAPER-HEADER PIC X(30) VALUE SPACES.
            05 ACU-PAPER-FOOTER PIC X(30) VALUE SPACES.
            05 ACU-PAPER-ORIENTATION PIC X(10).
            05 ACU-PAPER-ORIENTATIONINT SIGNED-INT.
            88 ACU-PAPER-PORTRAIT VALUE 1.
            88 ACU-PAPER-LANDSCAPE VALUE 2.
            05 ACU-PAPER-COPIES SIGNED-INT VALUE 0.
            05 ACU-PAPER-MARGIN.
            10 ACU-MARGIN-LEFT PIC 9(6).
            10 FILLER PIC X VALUE IS "|".
            10 ACU-MARGIN-RIGHT PIC 9(6).
            10 FILLER PIC X VALUE IS "|".
            10 ACU-MARGIN-TOP PIC 9(6).
            10 FILLER PIC X VALUE IS "|".
            10 ACU-MARGIN-BOTTOM PIC 9(6).
            10 FILLER PIC X VALUE IS " ".
            05 ACUPRINTDLL-STATUS SIGNED-INT.
            88 ACUPRINTDLL-FAIL VALUE 0.
            88 ACUPRINTDLL-SUCCESS VALUE 1.
       77 ACU-OCCURS-IDX PIC 9(4) VALUE 1.
       77 REPORT-HEADER-PRINT-BEFORE-PAGE PIC 9 VALUE 0.
       77 REPORT-FOOTER-PRINT-AFTER-PAGE PIC 9 VALUE 0.
       01 STAT-PRINTF.
            05 STAT-1-PRINTF PIC X(01).
            88 VALID-PRINTF VALUE "0".
            88 END-PRINTF VALUE "1".
            05 STAT-2-PRINTF PIC X(01).
       01 WS-PRINT-VARIABLE.
            05 CNT-LINE PIC 9(03).
            05 RPT-LINE REDEFINES CNT-LINE PIC 9(03).
            05 CNT-PAGE PIC 9(05).
            05 RPT-PAGE REDEFINES CNT-PAGE PIC 9(05).
            05 WSDATE.
            10 WSYY PIC 9(02).
            10 WSMM PIC 9(02).
            10 WSDD PIC 9(02).
            05 WSDATE-R REDEFINES WSDATE PIC 9(06).
            05 WSTIME.
            10 WSHH PIC 9(02).
            10 WSMN PIC 9(02).
            10 WSSS PIC 9(02).
            10 WSHS PIC 9(02).
            05 WSTIME-R REDEFINES WSTIME PIC 9(08).
            05 CRT-STATUS PIC 9(03).
            05 CRT-CURSOR.
            10 CRT-ROW PIC 9(02) VALUE 0.
            10 CRT-COL PIC 9(02) VALUE 0.
            05 DUMY-LINE PIC X(132) VALUE SPACES.
            05 PRINT-FULLNAME PIC X(132) VALUE SPACES.
            05 PTR-DEV-NAME PIC X(132) VALUE "PRINTER".
            05 PRINT-BUF PIC X(1024).
            05 PRINT-TMP-BUF PIC X(1024).
            05 INDENT-BUF PIC X(132).
            05 TMP-PIXELS PIC 9(06) VALUE 0.
            05 CNT-PIXELS PIC 9(06) VALUE 0.
            05 CNT-INPAGEPIXELS PIC 9(06) VALUE 0.
            05 CNT-INPAGEPIXELS-TMP PIC 9(06) VALUE 0.
            05 CNT-PIXELS-TMP PIC 9(06) VALUE 0.
            05 CNT-PAGENUM-TMP PIC 9(06) VALUE 0.
            05 CURRENT-HEIGHT PIC 9(06) VALUE 0.
            05 TMP-BUF-INT PIC 9(06) VALUE 0.
            05 RPT-RETURN-VALUE PIC 9 VALUE 0.
            05 TMP-FORM-INDEX PIC 9(2).
            05 HIGH-OFFSET PIC 9(06) VALUE 0.
            05 HIGH-OFFSET-IN PIC 9(06) VALUE 0.
            05 SECTION-HIGH-STACK PIC S9(6) VALUE 0.
            05 NEW-PAGE PIC 9 VALUE 0.
            05 NTOPCOLUMNNUM PIC 9(2) VALUE 1.
            05 CURRENT-COL PIC 9(2) VALUE 1.
            05 CURRENT-TEXTLINE PIC 9(3) VALUE 1.
            05 CURRENT-LEFTOFFSET PIC 9(6) VALUE 0.
            05 DETAIL-WIDTH PIC 9(6) VALUE 0.
            05 BREAKPAGE-BUF PIC X.
            05 NTOP-MAXLINES PIC 9(4) VALUE 0.
            05 TMP-PRINTORNOT PIC 9 VALUE 0.
            05 SYS-SHOWPAGEFOOTER PIC 9 VALUE 0.
            05 SYS-ISFIRSTLINE PIC 9 VALUE 1.
            05 SYS-ENDPRIMARYFD PIC 9 VALUE 0.
            05 RN-NTOP-TOTALCNT PIC 9(8) VALUE 0.
            05 RN-NTOP-CURRENTIDX PIC 9(8) VALUE 0.
            05 RN-NTOP-COLTOTAL PIC 9(8) VALUE 0.
            05 CALLBY-INDEX PIC 9(2) VALUE 0.
            05 PRT-FULLFILENAME PIC X(132).
            05 PRINT-BROWSER-PARA PIC X(132) VALUE SPACES.
            05 PRINT-UNIT-TYPE SIGNED-INT.
            05 NEW-PRINT-DATA-SIZE PIC 9(6) VALUE 0.
            05 PRINT-BUF-SIZE PIC 9(6) VALUE 0.
            05 PRINT-BUF-LENGTH PIC 9(6) VALUE 1024.
            05 PRINT-BUF-TRAIL-SPACES PIC 9(4) VALUE 0.
            05 PRINT-BUF-TOTAL-SPACES PIC 9(4) VALUE 0.
            05 PRINT-BUF-COUNT PIC 9(6) VALUE 0.
            05 PRINT-BUF-CHAR PIC X.
            05 NEW-PRINT-DATA PIC X(1024).
       77 PRINT-PTR POINTER.
       01 EXTEND-STAT.
            03 PRIMARY-ERROR PIC X(2).
            03 SECONDARY-ERROR PIC X(10).
       01 TEXT-MESSAGE PIC X(40).
       01 ACU-SHOW-MSG.
       05 ACU-CALL-FAIL-CODE PIC X(2).
       05 ACU-MSG-ID PIC 9(3).
       05 ACU-ERR-FILE PIC X(30).
       78 ACU-LENGTH VALUE 80.
       78 ACU-FULL-LEN VALUE 250.
       01 ACU-MSG-BOX.
       05 ACU-ICON-TYPE PIC 9 VALUE 1.
       05 ACU-DEFAULT-BUTTON PIC 9 VALUE 1.
       05 ACU-BUTTON-TYPE PIC 9 VALUE 1.
       05 ACU-RETURN-VALUE PIC 9 VALUE 1.
       05 ACU-MSG-1 PIC X(ACU-LENGTH).
       05 ACU-MSG-2 PIC X(ACU-LENGTH).
       05 ACU-MSG-3 PIC X(ACU-LENGTH).
       05 ACU-MSG-TEXT PIC X(ACU-FULL-LEN).
       05 ACU-TEXT-PTR SIGNED-SHORT.
       05 ACU-SIZE SIGNED-SHORT.
       77 ACU-IDX1 PIC 9(3).
       77 ACU-IDX2 PIC 9(3).
       77 ACU-IDX3 PIC 9(3).
       77 SALESDATA-STATUS PIC X(2).
            88 VALID-SALESDATA VALUE IS "00" THRU "09".
       77 REPORT1A-DTL-1-BGCOLOR PIC X(7) VALUE "#FFFFFF".
       01 REPORT1A-GROUPBY-BUF.
            03 FILLER PIC X.
       77 REPORT1A-DOPRINTRTN-LOOP PIC 9 VALUE 0.
       01 REPORT1A-HEIGHT.
            05 PAGE-HEIGHT PIC 9(04) VALUE 912.
            05 PAGE-WIDTH PIC 9(04) VALUE 672.
            05 REPORT1A-PH-1-DEF-HEIGHT PIC 9(4) VALUE 48.
            05 REPORT1A-PH-1-HEIGHT PIC 9(4) VALUE 48.
            05 REPORT1A-DTL-1-DEF-HEIGHT PIC 9(4) VALUE 96.
            05 REPORT1A-DTL-1-HEIGHT PIC 9(4) VALUE 96.
            05 REPORT1A-PF-1-DEF-HEIGHT PIC 9(4) VALUE 48.
            05 REPORT1A-PF-1-HEIGHT PIC 9(4) VALUE 48.
       77 REPORT1A-CLEFTOFFSET PIC 9(6) VALUE 0.
       LINKAGE SECTION.
       SCREEN SECTION.

       PROCEDURE DIVISION.
       DECLARATIVES.
       INPUT-ERROR SECTION.
            USE AFTER STANDARD ERROR PROCEDURE ON INPUT.
       0100-DECL.
            EXIT.
       I-O-ERROR SECTION.
            USE AFTER STANDARD ERROR PROCEDURE ON I-O.
       0200-DECL.
            EXIT.
       OUTPUT-ERROR SECTION.
            USE AFTER STANDARD ERROR PROCEDURE ON OUTPUT.
       0300-DECL.
            EXIT.
       SALESDATA-ERROR SECTION.
            USE AFTER STANDARD EXCEPTION PROCEDURE ON SALESDATA.
       END DECLARATIVES.
       ACU-MAIN-LOGIC.
            PERFORM ACU-INITIAL-ROUTINE
            PERFORM ACU-EXIT-RTN.
       ACU-EXTENDED-FILE-STATUS.
            CALL "C$RERRNAME" USING ACU-ERR-FILE
            CALL "C$RERR" USING EXTEND-STAT TEXT-MESSAGE
            MOVE PRIMARY-ERROR TO ACU-MSG-ID
            PERFORM ACU-SHOW-MSG.
       ACU-SHOW-MSG.
            MOVE SPACE TO ACU-MSG-1 ACU-MSG-2 ACU-MSG-3
            EVALUATE ACU-MSG-ID
              WHEN 10
              MOVE "No more data." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 22
              MOVE "Key duplication." TO ACU-MSG-1
              MOVE MB-ERROR-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 23
              MOVE "Record not found." TO ACU-MSG-1
              MOVE MB-WARNING-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 101
              MOVE "Quit?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 201
              MOVE "Add Record?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 202
              MOVE "Update Record?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 203
              MOVE "Delete Record?" TO ACU-MSG-1
              MOVE 4 TO ACU-ICON-TYPE
              MOVE MB-YES-NO TO ACU-BUTTON-TYPE
              WHEN 204
              MOVE "Key duplication." TO ACU-MSG-1
              MOVE MB-WARNING-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 301
              MOVE "Add Successful." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 302
              MOVE "Update Successful." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 303
              MOVE "Delete Successful." TO ACU-MSG-1
              MOVE MB-DEFAULT-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 401
              MOVE "Shell not found." TO ACU-MSG-1
              MOVE MB-ERROR-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN 901
              MOVE MB-WARNING-ICON TO ACU-ICON-TYPE
              MOVE MB-OK TO ACU-BUTTON-TYPE
              WHEN OTHER
              MOVE TEXT-MESSAGE TO ACU-MSG-1
              STRING "File:" ACU-ERR-FILE DELIMITED BY SPACE INTO
                ACU-MSG-2
              STRING "File status " PRIMARY-ERROR "," SECONDARY-ERROR
                DELIMITED BY SIZE INTO ACU-MSG-3
            END-EVALUATE
            PERFORM ACU-MESSAGE-BOX.
       ACU-MESSAGE-BOX.
            MOVE 1 TO ACU-TEXT-PTR
            IF ACU-MSG-1 NOT = SPACE
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-1 TALLYING ACU-SIZE FOR TRAILING SPACE
              STRING ACU-MSG-1 ( 1 : ACU-LENGTH - ACU-SIZE ) DELIMITED
                BY SIZE INTO ACU-MSG-TEXT POINTER ACU-TEXT-PTR
            END-IF
            IF ACU-MSG-2 NOT = SPACE
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-2 TALLYING ACU-SIZE FOR TRAILING SPACE
              IF ACU-TEXT-PTR > 1
                STRING X"0A" DELIMITED BY SIZE INTO ACU-MSG-TEXT POINTER
                  ACU-TEXT-PTR
              END-IF
              STRING ACU-MSG-2 ( 1 : ACU-LENGTH - ACU-SIZE ) DELIMITED
                BY SIZE INTO ACU-MSG-TEXT POINTER ACU-TEXT-PTR
            END-IF
            IF ACU-MSG-3 NOT = SPACE
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-3 TALLYING ACU-SIZE FOR TRAILING SPACE
              IF ACU-TEXT-PTR > 1
                STRING X"0A" DELIMITED BY SIZE INTO ACU-MSG-TEXT POINTER
                  ACU-TEXT-PTR
              END-IF
              STRING ACU-MSG-3 ( 1 : ACU-LENGTH - ACU-SIZE ) DELIMITED
                BY SIZE INTO ACU-MSG-TEXT POINTER ACU-TEXT-PTR
            END-IF
            IF ACU-TEXT-PTR = 1
              MOVE 0 TO ACU-SIZE
              INSPECT ACU-MSG-TEXT TALLYING ACU-SIZE FOR TRAILING SPACE
              COMPUTE ACU-TEXT-PTR = ACU-FULL-LEN - ACU-SIZE + 1
            END-IF
            MOVE LOW-VALUES TO ACU-MSG-TEXT ( ACU-TEXT-PTR : 1 )
            DISPLAY MESSAGE BOX ACU-MSG-TEXT TYPE IS ACU-BUTTON-TYPE
              ICON IS ACU-ICON-TYPE DEFAULT IS ACU-DEFAULT-BUTTON
              RETURNING ACU-RETURN-VALUE.
       ACU-INITIAL-ROUTINE.
            ACCEPT SYSTEM-INFORMATION FROM SYSTEM-INFO
            ACCEPT TERMINAL-ABILITIES FROM TERMINAL-INFO
            PERFORM ACU-OPEN-FILES
            PERFORM REPORT1A-AFTER-INIT.
       ACU-EXIT-RTN.
            PERFORM ACU-EXIT-FONT
            PERFORM ACU-EXIT-BMP
            PERFORM ACU-CLOSE-FILES
            EXIT PROGRAM
            STOP RUN.
       ACU-EXIT-FONT.
            .
       ACU-EXIT-BMP.
            .
       ACU-OPEN-FILES.
            PERFORM ACU-OPEN-SALESDATA.
       ACU-OPEN-SALESDATA.
            OPEN INPUT SALESDATA
            IF NOT SALESDATA-STATUS ( 1 : 1 ) = "0"
              PERFORM ACU-EXTENDED-FILE-STATUS
              GO TO ACU-EXIT-RTN
            END-IF.
       ACU-CLOSE-FILES.
            CLOSE SALESDATA.
       ACU-SALESDATADS-READ.
            READ SALESDATA WITH NO LOCK KEY SALES-KEY OF SALESDATA.
       ACU-SALESDATADS-READ-NEXT.
            READ SALESDATA NEXT WITH NO LOCK.
       ACU-SALESDATADS-READ-PREV.
            READ SALESDATA PREVIOUS WITH NO LOCK.
       ACU-SALESDATADS-DELETE.
            DELETE FILE SALESDATA.
       REPORT1A-AFTER-INIT.
            PERFORM ACU-REPORT1A-PREVIEW.
       REPORT1A-BEFOREDOPRINT.
            MOVE 1 TO REPORT1A-DOPRINTRTN-LOOP.
            MOVE LOW-VALUES TO SALES-KEY.
            START SALESDATA KEY > SALES-KEY.
            READ SALESDATA NEXT RECORD AT END
            MOVE "10" TO SALESDATA-STATUS
            INITIALIZE REPORT1A-DOPRINTRTN-LOOP
            END-READ.
       REPORT1A-AFTERDOPRINT.
            READ SALESDATA NEXT RECORD AT END
            MOVE "10" TO SALESDATA-STATUS
            INITIALIZE REPORT1A-DOPRINTRTN-LOOP
            END-READ.
       ACU-REPORT1A-HTML-HEADER.
            MOVE "<HTML>" TO PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "<HEAD><TITLE>  </TITLE></HEAD>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            PERFORM ACU-REPORT1A-HTML-CSS
            MOVE '<BODY STYLE="BACKGROUND-COLOR:#FFFFFF;">' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-HTML-FOOTER.
            MOVE "</BODY>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "</HTML>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-HTML-CSS.
            MOVE '<STYLE TYPE="TEXT/CSS">' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-Header {PAGE-BREAK-BEFORE:ALWAYS; POSITION:R
      -     "ELATIVE; TOP:0; LEFT:0; WIDTH:672; HEIGHT:912}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            MOVE
              "   .Report1a-Header-0 {POSITION:RELATIVE; TOP:0; LEFT:0; 
      -     "WIDTH:672; HEIGHT:912}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwLa-1 {POSITION:ABSOLUTE; TOP:6; LEFT:21; W
      -     "IDTH:129; HEIGHT:18; BACKGROUND-COLOR:TRANSPARENT; }"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwEf-1 {POSITION:ABSOLUTE; TOP:6; LEFT:177; 
      -     "WIDTH:26; HEIGHT:18; BORDER-STYLE:SOLID; BORDER-WIDTH:1px; 
      -     "border-color:#000000; LETTER-SPACING:0.00; BACKGROUND-COLOR
      -     ":TRANSPARENT; OVERFLOW:HIDDEN}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwLa-2 {POSITION:ABSOLUTE; TOP:27; LEFT:21; 
      -     "WIDTH:129; HEIGHT:18; BACKGROUND-COLOR:TRANSPARENT; }"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwEf-2 {POSITION:ABSOLUTE; TOP:27; LEFT:177;
      -     " WIDTH:38; HEIGHT:18; BORDER-STYLE:SOLID; BORDER-WIDTH:1px;
      -     " border-color:#000000; LETTER-SPACING:0.00; BACKGROUND-COLO
      -     "R:TRANSPARENT; OVERFLOW:HIDDEN}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwLa-3 {POSITION:ABSOLUTE; TOP:48; LEFT:21; 
      -     "WIDTH:129; HEIGHT:18; BACKGROUND-COLOR:TRANSPARENT; }"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwEf-3 {POSITION:ABSOLUTE; TOP:48; LEFT:177;
      -     " WIDTH:302; HEIGHT:18; BORDER-STYLE:SOLID; BORDER-WIDTH:1px
      -     "; border-color:#000000; LETTER-SPACING:0.00; BACKGROUND-COL
      -     "OR:TRANSPARENT; OVERFLOW:HIDDEN}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwLa-4 {POSITION:ABSOLUTE; TOP:69; LEFT:21; 
      -     "WIDTH:129; HEIGHT:18; BACKGROUND-COLOR:TRANSPARENT; }"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-RwEf-4 {POSITION:ABSOLUTE; TOP:69; LEFT:177;
      -     " WIDTH:302; HEIGHT:18; BORDER-STYLE:SOLID; BORDER-WIDTH:1px
      -     "; border-color:#000000; LETTER-SPACING:0.00; BACKGROUND-COL
      -     "OR:TRANSPARENT; OVERFLOW:HIDDEN}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE
              "   .Report1a-Footer {POSITION:ABSOLUTE; TOP:864; LEFT:0; 
      -     "WIDTH:672}"
             TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "</STYLE>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-PRINT-PARA.
            MOVE SPACES TO PRINT-FULLNAME
            CALL "C$FULLNAME" USING "Report1a.html" PRINT-FULLNAME
              GIVING ACU-STATUS-CODE
            IF ACU-STATUS-CODE = 1
              MOVE 0 TO ACU-SETUPPRINT
              EXIT PARAGRAPH
            END-IF
            MOVE 0 TO ACU-IDX1
            INSPECT PRINT-FULLNAME TALLYING ACU-IDX1 FOR ALL "\"
            INSPECT PRINT-FULLNAME REPLACING TRAILING SPACE BY "*"
            IF ACU-IDX1 <= 0
              MOVE SPACES TO DUMY-LINE
              CALL "C$CHDIR" USING DUMY-LINE
              INSPECT DUMY-LINE REPLACING TRAILING SPACE BY "*"
              MOVE 0 TO ACU-STATUS-CODE
              PERFORM VARYING ACU-IDX2 FROM 1 BY 1 UNTIL ACU-STATUS-CODE
                = 1
              IF DUMY-LINE ( ACU-IDX2 : 1 ) = "*"
                MOVE 1 TO ACU-STATUS-CODE
              END-IF
              END-PERFORM
              IF DUMY-LINE ( ACU-IDX2 - 2 : 1 ) = "\"
                STRING DUMY-LINE PRINT-FULLNAME X"00" DELIMITED BY "*"
                  INTO PRT-FULLFILENAME
              ELSE
                STRING DUMY-LINE "\" PRINT-FULLNAME X"00" DELIMITED BY 
                "*"
                 INTO PRT-FULLFILENAME
              END-IF
            ELSE
              STRING PRINT-FULLNAME X"00" DELIMITED BY "*" INTO
                PRT-FULLFILENAME
            END-IF
            STRING "Letter" X"00" DELIMITED BY SIZE INTO ACU-PAPER-SIZE
            STRING "&w&bPage &p of &P" X"00" DELIMITED BY SIZE INTO
              ACU-PAPER-HEADER
            STRING "&u&b&d" X"00" DELIMITED BY SIZE INTO
              ACU-PAPER-FOOTER
            MOVE "PORTRAIT" TO ACU-PAPER-ORIENTATION
            IF ACU-PAPER-ORIENTATION = "LANDSCAPE"
              MOVE 2 TO ACU-PAPER-ORIENTATIONINT
            ELSE
              MOVE 1 TO ACU-PAPER-ORIENTATIONINT
            END-IF
            STRING "PORTRAIT" X"00" DELIMITED BY SIZE INTO
              ACU-PAPER-ORIENTATION
            MOVE "75" TO ACU-MARGIN-LEFT
            MOVE "75" TO ACU-MARGIN-RIGHT
            MOVE "75" TO ACU-MARGIN-TOP
            MOVE "75" TO ACU-MARGIN-BOTTOM
            STRING ACU-PAPER-MARGIN X"00" DELIMITED BY SIZE INTO
              PRINT-BROWSER-PARA
            IF ACU-PAPER-COPIES = 0 OR ACU-PAPER-COPIES ( 1 : ) = SPACES
              MOVE 1 TO ACU-PAPER-COPIES
            END-IF
            MOVE SPACES TO DUMY-LINE.
       ACU-REPORT1A-SETUP-PRINT.
            MOVE 1 TO ACU-SETUPPRINT
            PERFORM ACU-REPORT1A-PRINT-PARA
            SET ENVIRONMENT "DLL_CONVENTION" TO "1"
            CALL "AcuBenchPrintDummy" ON EXCEPTION
            CALL "AcuBenchPrint.dll"
            END-CALL
            END-CALL
            CALL "AcuBenchPrintExecWBPageSetup" USING BY CONTENT
              PRINT-BROWSER-PARA BY CONTENT ACU-PAPER-SIZE BY VALUE
              ACU-PAPER-ORIENTATIONINT BY CONTENT ACU-PRINTER-NAME
              GIVING ACUPRINTDLL-STATUS
            END-CALL
            IF ACUPRINTDLL-SUCCESS
              MOVE 1 TO PRINT-UNIT-TYPE
              SET PRINT-PTR TO ADDRESS OF ACU-PAPER-MARGIN
              CALL "AcuBenchPrintGetMargins" USING BY VALUE
                PRINT-UNIT-TYPE PRINT-PTR
              SET PRINT-PTR TO ADDRESS OF ACU-PAPER-SIZEINT
              CALL "AcuBenchPrintGetPaperSize" USING BY VALUE
                PRINT-UNIT-TYPE PRINT-PTR
              COMPUTE PAGE-HEIGHT OF REPORT1A-HEIGHT = ACU-PAPER-HEIGHT
                - ACU-MARGIN-TOP - ACU-MARGIN-BOTTOM
              COMPUTE PAGE-WIDTH OF REPORT1A-HEIGHT = ACU-PAPER-WIDTH -
                ACU-MARGIN-LEFT - ACU-MARGIN-RIGHT
              MOVE 2 TO PRINT-UNIT-TYPE
              SET PRINT-PTR TO ADDRESS OF ACU-PAPER-MARGIN
              CALL "AcuBenchPrintGetMargins" USING BY VALUE
                PRINT-UNIT-TYPE PRINT-PTR
              STRING ACU-PAPER-MARGIN X"00" DELIMITED BY SIZE INTO
                PRINT-BROWSER-PARA
              SET PRINT-PTR TO ADDRESS OF ACU-PAPER-SIZE
              CALL "AcuBenchPrintGetPaperName" USING BY VALUE PRINT-PTR
              CALL "AcuBenchPrintGetOrientation" GIVING
                ACU-PAPER-ORIENTATIONINT
              CALL "AcuBenchPrintGetCopies" GIVING ACU-PAPER-COPIES
              SET PRINT-PTR TO ADDRESS OF ACU-PRINTER-NAME
              CALL "AcuBenchPrintGetPrinterName" USING BY VALUE
                PRINT-PTR
              PERFORM ACU-REPORT1A-PRINT-TOFILE
              PERFORM ACU-REPORT1A-DO-PRINT
            END-IF.
       ACU-REPORT1A-PRINT.
            MOVE 0 TO ACU-SETUPPRINT
            PERFORM ACU-REPORT1A-PRINT-TOFILE.
       ACU-REPORT1A-PRINT-TOPDF.
           CALL "C$SYSTEM" USING "wkhtmltopdf.exe -q Report1a.html Repor
      -                          "t1a.pdf" 96     
           CALL "C$SYSTEM" USING "Report1a.pdf" 96.
       ACU-REPORT1A-DO-PRINT.
            IF ACU-SETUPPRINT = 0
              PERFORM ACU-REPORT1A-PRINT-PARA
              SET ENVIRONMENT "DLL_CONVENTION" TO "1"
              CALL "AcuBenchPrintDummy" ON EXCEPTION
              CALL "AcuBenchPrint.dll"
              END-CALL
              END-CALL
            END-IF
            CALL "AcuBenchPrintExecWBPrint" USING BY CONTENT
              PRT-FULLFILENAME OMITTED BY CONTENT PRINT-BROWSER-PARA BY
              CONTENT ACU-PAPER-HEADER BY CONTENT ACU-PAPER-FOOTER BY
              CONTENT ACU-PAPER-SIZE BY VALUE ACU-PAPER-ORIENTATIONINT
              BY VALUE ACU-PAPER-COPIES BY CONTENT ACU-PRINTER-NAME
            END-CALL
            MOVE 0 TO ACU-SETUPPRINT.
       ACU-REPORT1A-PREVIEW.
            PERFORM ACU-REPORT1A-PRINT-TOFILE
            PERFORM ACU-REPORT1A-PRINT-PARA
            PERFORM ACU-REPORT1A-PRINT-TOPDF.
      *     SET ENVIRONMENT "DLL_CONVENTION" TO "1"
      *     CALL "AcuBenchPrintDummy" ON EXCEPTION
      *     CALL "AcuBenchPrint.dll"
      *     END-CALL
      *     END-CALL
      *     CALL "AcuBenchPrintExecWBPreview" USING BY CONTENT
      *       PRT-FULLFILENAME BY CONTENT PRINT-BROWSER-PARA BY CONTENT
      *       ACU-PAPER-HEADER BY CONTENT ACU-PAPER-FOOTER BY CONTENT
      *       ACU-PAPER-SIZE BY VALUE ACU-PAPER-ORIENTATIONINT BY
      *       CONTENT ACU-PRINTER-NAME
      *     END-CALL.
       ACU-REPORT1A-PRINT-TOFILE.
            MOVE "Report1a.html" TO PTR-DEV-NAME.
            MOVE 1 TO CURRENT-COL
            MOVE 0 TO REPORT1A-CLEFTOFFSET
            MOVE 0 TO CNT-PIXELS
            MOVE 0 TO CNT-INPAGEPIXELS
            MOVE 1 TO ACU-PAGENUM
            MOVE 1 TO ACU-PAGENUM-SYS
            MOVE 1 TO NTOPCOLUMNNUM
            PERFORM ACU-PRINTF-OPEN-ROUTINE.
            PERFORM ACU-REPORT1A-HTML-HEADER.
            PERFORM ACU-REPORT1A-HTML-PAGE-HEADER.
            PERFORM ACU-RPT-REPORT1A-PRINT-LOOP.
            PERFORM ACU-REPORT1A-HTML-FOOTER.
            PERFORM ACU-PRINTF-CLOSE-ROUTINE.
       ACU-RPT-REPORT1A-PRINT-LOOP.
            MOVE 1 TO TMP-PRINTORNOT
            MOVE 0 TO SYS-ENDPRIMARYFD
            PERFORM ACU-RPT-REPORT1A-ALL-RESET
            PERFORM ACU-RPT-REPORT1A-REPORT-HEADER
            PERFORM ACU-RPT-REPORT1A-MASTER-PRINT-LOOP
            PERFORM ACU-RPT-REPORT1A-PAGE-HEADER
            PERFORM ACU-RPT-REPORT1A-GROUP-MUSTDSP
            PERFORM ACU-RPT-REPORT1A-GROUP-FOOTER
            IF ( REPORT-FOOTER-PRINT-AFTER-PAGE = 0 )
              PERFORM ACU-RPT-REPORT1A-REPORT-FOOTER
            END-IF
            PERFORM ACU-REPORT1A-FILL-DETAIL-FOR-ZEBRA
            IF ( REPORT-FOOTER-PRINT-AFTER-PAGE = 0 )
              MOVE 1 TO SYS-ENDPRIMARYFD
              COMPUTE CNT-PIXELS = ACU-PAGENUM-SYS * PAGE-HEIGHT OF
                REPORT1A-HEIGHT - REPORT1A-PF-1-DEF-HEIGHT OF
                REPORT1A-HEIGHT
              COMPUTE CNT-INPAGEPIXELS = PAGE-HEIGHT OF REPORT1A-HEIGHT
                - REPORT1A-PF-1-DEF-HEIGHT OF REPORT1A-HEIGHT
              MOVE PAGE-HEIGHT OF REPORT1A-HEIGHT TO CNT-INPAGEPIXELS
              PERFORM ACU-RPT-REPORT1A-PAGE-FOOTER
            END-IF
            IF ( REPORT-FOOTER-PRINT-AFTER-PAGE = 1 )
              PERFORM ACU-RPT-REPORT1A-REPORT-FOOTER
            END-IF.
       ACU-REPORT1A-HTML-PAGE-HEADER.
            MOVE " <!-- Page DIV -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            IF ACU-PAGENUM < 2
              MOVE ' <DIV CLASS="Report1a-Header-0" >' TO PRINT-BUF
            ELSE
              MOVE ' <DIV CLASS="Report1a-Header" >' TO PRINT-BUF
            END-IF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-HTML-PAGE-FOOTER.
            MOVE " <!-- End(Page) --></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-RPT-REPORT1A-REPORT-HEADER.
            .
       ACU-RPT-REPORT1A-REPORT-FOOTER.
            .
       ACU-RPT-REPORT1A-PAGE-HEADER.
            IF ( CNT-INPAGEPIXELS < REPORT1A-PH-1-HEIGHT OF
                REPORT1A-HEIGHT ) OR ( REPORT-HEADER-PRINT-BEFORE-PAGE =
                1 )
              PERFORM ACU-REPORT1A-PH-1-PRINT-RTN
              ADD REPORT1A-PH-1-HEIGHT OF REPORT1A-HEIGHT TO CNT-PIXELS
              IF ( REPORT-HEADER-PRINT-BEFORE-PAGE = 1 )
                ADD REPORT1A-PH-1-HEIGHT OF REPORT1A-HEIGHT TO
                  CNT-INPAGEPIXELS
              ELSE
                MOVE REPORT1A-PH-1-HEIGHT OF REPORT1A-HEIGHT TO
                  CNT-INPAGEPIXELS
              END-IF
            END-IF.
       ACU-RPT-REPORT1A-PAGE-FOOTER.
            COMPUTE TMP-PIXELS = CNT-INPAGEPIXELS + CURRENT-HEIGHT +
              REPORT1A-PF-1-HEIGHT OF REPORT1A-HEIGHT
            IF TMP-PIXELS > PAGE-HEIGHT OF REPORT1A-HEIGHT
              COMPUTE CNT-PIXELS = ACU-PAGENUM-SYS * PAGE-HEIGHT OF
                REPORT1A-HEIGHT - REPORT1A-PF-1-HEIGHT OF
                REPORT1A-HEIGHT
              COMPUTE CNT-INPAGEPIXELS = PAGE-HEIGHT OF REPORT1A-HEIGHT
                - REPORT1A-PF-1-DEF-HEIGHT OF REPORT1A-HEIGHT
              PERFORM ACU-REPORT1A-PF-1-PRINT-RTN
              PERFORM ACU-REPORT1A-PAGE-BREAK-RTN
              MOVE REPORT1A-PF-1-DEF-HEIGHT OF REPORT1A-HEIGHT TO
                REPORT1A-PF-1-HEIGHT OF REPORT1A-HEIGHT
            END-IF.
       ACU-RPT-REPORT1A-PAGE-FOOTER-OVERPAGE.
            MOVE 0 TO RPT-RETURN-VALUE
            COMPUTE TMP-PIXELS = CNT-INPAGEPIXELS + CURRENT-HEIGHT +
              REPORT1A-PF-1-HEIGHT OF REPORT1A-HEIGHT
            IF TMP-PIXELS + 1 >= PAGE-HEIGHT OF REPORT1A-HEIGHT
              MOVE 1 TO RPT-RETURN-VALUE
            END-IF.
       ACU-RPT-REPORT1A-DETAIL.
            PERFORM ACU-REPORT1A-DTL-1-DETAIL-PRINT.
            .
       ACU-RPT-REPORT1A-GROUP-HEADER.
            .
       ACU-RPT-REPORT1A-GROUP-FOOTER.
            .
       ACU-RPT-REPORT1A-GROUP-MUSTDSP.
            .
       ACU-RPT-REPORT1A-GROUP-NOMUSTDSP.
            .
       ACU-RPT-REPORT1A-ALL-RESET.
            .
       ACU-RPT-REPORT1A-DO-PRINT-RTN.
            MOVE 1 TO TMP-PRINTORNOT
            PERFORM ACU-RPT-REPORT1A-GROUP-FOOTER
            MOVE REPORT1A-DTL-1-HEIGHT OF REPORT1A-HEIGHT TO
              CURRENT-HEIGHT
            PERFORM ACU-RPT-REPORT1A-PAGE-FOOTER
            PERFORM ACU-RPT-REPORT1A-PAGE-HEADER
            PERFORM ACU-RPT-REPORT1A-GROUP-HEADER
            PERFORM ACU-RPT-REPORT1A-DETAIL.
       ACU-REPORT1A-PAGE-BREAK-RTN.
            IF CURRENT-COL < NTOPCOLUMNNUM
              COMPUTE CNT-PIXELS = ( ACU-PAGENUM-SYS - 1 ) * PAGE-HEIGHT
                OF REPORT1A-HEIGHT
              COMPUTE REPORT1A-CLEFTOFFSET = REPORT1A-CLEFTOFFSET +
                DETAIL-WIDTH
              MOVE 0 TO CNT-INPAGEPIXELS
              ADD 1 TO CURRENT-COL
            ELSE
              COMPUTE CNT-PIXELS = ACU-PAGENUM-SYS * PAGE-HEIGHT OF
                REPORT1A-HEIGHT
              MOVE 0 TO REPORT1A-CLEFTOFFSET
              MOVE 0 TO CNT-INPAGEPIXELS
              ADD 1 TO ACU-PAGENUM-SYS
              ADD 1 TO ACU-PAGENUM
              MOVE 1 TO CURRENT-COL
            END-IF
            PERFORM ACU-REPORT1A-HTML-PAGE-FOOTER
            IF SYS-ENDPRIMARYFD = 0
              PERFORM ACU-REPORT1A-HTML-PAGE-HEADER
            END-IF.
       ACU-REPORT1A-FILL-DETAIL-FOR-ZEBRA.
            .
       ACU-REPORT1A-ZEBRA-COLOR-CHANGE.
            .
       ACU-REPORT1A-DTL-1-DETAIL-PRINT.
            MOVE 816 TO DETAIL-WIDTH
            MOVE REPORT1A-DTL-1-HEIGHT OF REPORT1A-HEIGHT TO
              CURRENT-HEIGHT
            PERFORM ACU-RPT-REPORT1A-PAGE-FOOTER
            PERFORM ACU-RPT-REPORT1A-PAGE-HEADER
            PERFORM ACU-REPORT1A-DTL-1-PRINT-RTN
            ADD REPORT1A-DTL-1-HEIGHT OF REPORT1A-HEIGHT TO CNT-PIXELS
            ADD REPORT1A-DTL-1-HEIGHT OF REPORT1A-HEIGHT TO
              CNT-INPAGEPIXELS
            MOVE REPORT1A-DTL-1-DEF-HEIGHT OF REPORT1A-HEIGHT TO
              REPORT1A-DTL-1-HEIGHT OF REPORT1A-HEIGHT
            PERFORM ACU-REPORT1A-ZEBRA-COLOR-CHANGE.
       ACU-REPORT1A-PH-1-SEC-HEAD.
            MOVE "   <!-- Section (Report1a-PH-1) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            COMPUTE TMP-PIXELS = CNT-INPAGEPIXELS - HIGH-OFFSET-IN
            STRING '   <DIV STYLE="' "POSITION:ABSOLUTE; TOP:"
              TMP-PIXELS "; LEFT:0" "; WIDTH:816; " "FONT-SIZE:9pt; "
              "FONT-FAMILY:MS Sans Serif; " "COLOR:#000000; "
              "BACKGROUND-COLOR:#FFFFFF; " '">' DELIMITED BY SIZE INTO
              PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-PH-1-SEC-FOOT.
            MOVE "      <!-- Ending DIV : to fill the Div Height -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING '      <DIV STYLE="POSITION:RELATIVE; HEIGHT:'
              REPORT1A-PH-1-HEIGHT OF REPORT1A-HEIGHT ';"> </DIV>'
              DELIMITED BY SIZE INTO PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "   <!-- End(Section) --></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001.
       ACU-REPORT1A-PH-1-PRINT-RTN.
            MOVE 0 TO SECTION-HIGH-STACK
            MOVE REPORT1A-PH-1-DEF-HEIGHT TO REPORT1A-PH-1-HEIGHT
            PERFORM ACU-REPORT1A-PH-1-SEC-HEAD
            PERFORM ACU-REPORT1A-PH-1-SEC-FOOT.
       ACU-REPORT1A-DTL-1-SEC-HEAD.
            MOVE "   <!-- Section (Report1a-Dtl-1) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            COMPUTE TMP-PIXELS = CNT-INPAGEPIXELS - HIGH-OFFSET-IN
            STRING '   <DIV STYLE="' "POSITION:ABSOLUTE; TOP:"
              TMP-PIXELS "; LEFT:0" "; WIDTH:816; " "FONT-SIZE:9pt; "
              "FONT-FAMILY:MS Sans Serif; " "COLOR:#000000; "
              "BACKGROUND-COLOR:" REPORT1A-DTL-1-BGCOLOR '">' DELIMITED
              BY SIZE INTO PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-DTL-1-SEC-FOOT.
            MOVE "      <!-- Ending DIV : to fill the Div Height -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING '      <DIV STYLE="POSITION:RELATIVE; HEIGHT:'
              REPORT1A-DTL-1-HEIGHT OF REPORT1A-HEIGHT ';"> </DIV>'
              DELIMITED BY SIZE INTO PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "   <!-- End(Section) --></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001.
       ACU-REPORT1A-DTL-1-PRINT-RTN.
            MOVE 0 TO SECTION-HIGH-STACK
            MOVE REPORT1A-DTL-1-DEF-HEIGHT TO REPORT1A-DTL-1-HEIGHT
            PERFORM ACU-REPORT1A-DTL-1-SEC-HEAD
            MOVE "      <!-- Label (Report1a-RwLa-1) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwLa-1" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING "         <STRONG>" "Sales-State" "</STRONG></DIV>"
              DELIMITED BY SIZE INTO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Entry-Field (Report1a-RwEf-1) -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwEf-1" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         <STRONG>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE SALES-STATE TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         </STRONG></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Label (Report1a-RwLa-2) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwLa-2" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING "         <STRONG>" "Sales-Branch-No" 
            "</STRONG></DIV>"
             DELIMITED BY SIZE INTO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Entry-Field (Report1a-RwEf-2) -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwEf-2" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         <STRONG>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE SALES-BRANCH-NO TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         </STRONG></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Label (Report1a-RwLa-3) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwLa-3" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING "         <STRONG>" "Sales-LastName" 
            "</STRONG></DIV>"
             DELIMITED BY SIZE INTO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Entry-Field (Report1a-RwEf-3) -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwEf-3" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         <STRONG>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE SALES-LASTNAME TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         </STRONG></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Label (Report1a-RwLa-4) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwLa-4" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING "         <STRONG>" "Sales-FirstName" 
            "</STRONG></DIV>"
             DELIMITED BY SIZE INTO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "      <!-- Entry-Field (Report1a-RwEf-4) -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE '      <DIV CLASS="Report1a-RwEf-4" >' TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         <STRONG>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE SALES-FIRSTNAME TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "         </STRONG></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            PERFORM ACU-REPORT1A-DTL-1-SEC-FOOT.
       ACU-REPORT1A-PF-1-SEC-HEAD.
            MOVE "   <!-- Section (Report1a-PF-1) -->" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING '   <DIV CLASS="Report1a-Footer", STYLE="'
              "FONT-SIZE:9pt; " "FONT-FAMILY:MS Sans Serif; "
              "COLOR:#000000; " "BACKGROUND-COLOR:#FFFFFF; " '">'
              DELIMITED BY SIZE INTO PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF.
       ACU-REPORT1A-PF-1-SEC-FOOT.
            MOVE "      <!-- Ending DIV : to fill the Div Height -->" TO
              PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            STRING '      <DIV STYLE="POSITION:RELATIVE; HEIGHT:'
              REPORT1A-PF-1-HEIGHT OF REPORT1A-HEIGHT ';"> </DIV>'
              DELIMITED BY SIZE INTO PRINT-BUF.
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001
            INITIALIZE PRINT-BUF
            MOVE "   <!-- End(Section) --></DIV>" TO PRINT-BUF
            WRITE PRINTF-R FROM PRINT-BUF AFTER 001.
       ACU-REPORT1A-PF-1-PRINT-RTN.
            MOVE 0 TO SECTION-HIGH-STACK
            MOVE REPORT1A-PF-1-DEF-HEIGHT TO REPORT1A-PF-1-HEIGHT
            PERFORM ACU-REPORT1A-PF-1-SEC-HEAD
            PERFORM ACU-REPORT1A-PF-1-SEC-FOOT.
       ACU-PRINTF-OPEN-ROUTINE.
            OPEN OUTPUT PRINTF WITH NO REWIND.
            MOVE STAT-PRINTF TO STAT-PRINTF.
            IF NOT VALID-PRINTF
              MOVE "PRINTF" TO ACU-ERR-FILE.
       ACU-PRINTF-CLOSE-ROUTINE.
            CLOSE PRINTF.
       ACU-FORMAT-PRINT-BUF.
            INITIALIZE NEW-PRINT-DATA-SIZE PRINT-BUF-SIZE
              PRINT-BUF-LENGTH PRINT-BUF-TRAIL-SPACES
              PRINT-BUF-TOTAL-SPACES PRINT-BUF-COUNT
            SET PRINT-BUF-LENGTH TO LENGTH OF PRINT-BUF
            INSPECT PRINT-BUF TALLYING PRINT-BUF-TRAIL-SPACES FOR
              TRAILING SPACES
            INSPECT PRINT-BUF TALLYING PRINT-BUF-TOTAL-SPACES FOR ALL
              SPACES
            COMPUTE PRINT-BUF-SIZE = PRINT-BUF-LENGTH -
              PRINT-BUF-TRAIL-SPACES
            IF PRINT-BUF-SIZE = 0 OR PRINT-BUF-TOTAL-SPACES =
                PRINT-BUF-TRAIL-SPACES
              MOVE PRINT-BUF TO NEW-PRINT-DATA
              INSPECT NEW-PRINT-DATA REPLACING TRAILING SPACES BY
                LOW-VALUES
              EXIT PARAGRAPH
            END-IF
            INITIALIZE NEW-PRINT-DATA
            PERFORM VARYING PRINT-BUF-COUNT FROM 1 BY +1 UNTIL
              PRINT-BUF-COUNT > PRINT-BUF-SIZE OR NEW-PRINT-DATA-SIZE >
              PRINT-BUF-LENGTH
            MOVE PRINT-BUF ( PRINT-BUF-COUNT : 1 ) TO PRINT-BUF-CHAR
            IF PRINT-BUF-CHAR = " "
              STRING NEW-PRINT-DATA DELIMITED BY SPACES "&nbsp;"
                DELIMITED BY SIZE INTO NEW-PRINT-DATA
              END-STRING
              ADD 6 TO NEW-PRINT-DATA-SIZE
            ELSE
              STRING NEW-PRINT-DATA DELIMITED BY SPACES PRINT-BUF-CHAR
                DELIMITED BY SIZE INTO NEW-PRINT-DATA
              END-STRING
              ADD 1 TO NEW-PRINT-DATA-SIZE
            END-IF
            END-PERFORM
            INSPECT NEW-PRINT-DATA REPLACING TRAILING SPACES BY
              LOW-VALUES.
       REPORT-COMPOSER SECTION.
       ACU-RPT-REPORT1A-MASTER-PRINT-LOOP.
            PERFORM REPORT1A-BEFOREDOPRINT
            PERFORM UNTIL REPORT1A-DOPRINTRTN-LOOP = 0
            PERFORM ACU-RPT-REPORT1A-DO-PRINT-RTN
            PERFORM REPORT1A-AFTERDOPRINT
            END-PERFORM.
