       IDENTIFICATION DIVISION.
       PROGRAM-ID.                      PID.
       AUTHOR.  MIT. 
       REMARKS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 PROCESS-ID PIC 9(10).

       LINKAGE SECTION.

       SCREEN SECTION.

       PROCEDURE DIVISION.
           CALL "C$GETPID" GIVING PROCESS-ID.
           DISPLAY PROCESS-ID
           ACCEPT OMITTED
           GOBACK.